/* automatically generated by rust-bindgen 0.65.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const RC_ESC_DJI_MAX_US: u32 = 1920;
pub const __BITS_PER_LONG: u32 = 32;
pub const __FD_SETSIZE: u32 = 1024;
pub const _IOC_NRBITS: u32 = 8;
pub const _IOC_TYPEBITS: u32 = 8;
pub const _IOC_SIZEBITS: u32 = 14;
pub const _IOC_DIRBITS: u32 = 2;
pub const _IOC_NRMASK: u32 = 255;
pub const _IOC_TYPEMASK: u32 = 255;
pub const _IOC_SIZEMASK: u32 = 16383;
pub const _IOC_DIRMASK: u32 = 3;
pub const _IOC_NRSHIFT: u32 = 0;
pub const _IOC_TYPESHIFT: u32 = 8;
pub const _IOC_SIZESHIFT: u32 = 16;
pub const _IOC_DIRSHIFT: u32 = 30;
pub const _IOC_NONE: u32 = 0;
pub const _IOC_WRITE: u32 = 1;
pub const _IOC_READ: u32 = 2;
pub const IOC_IN: u32 = 1073741824;
pub const IOC_OUT: u32 = 2147483648;
pub const IOC_INOUT: u32 = 3221225472;
pub const IOCSIZE_MASK: u32 = 1073676288;
pub const IOCSIZE_SHIFT: u32 = 16;
pub const SPI_MODE_0: u32 = 0;
pub const SPI_IOC_MAGIC: u8 = 107u8;
pub const RC_SPI_MAX_SPEED: u32 = 24000000;
pub const RC_SPI_MIN_SPEED: u32 = 1000;
pub const RC_SPI_BITS_PER_WORD: u32 = 8;
pub const RC_PID_DIR: &[u8; 10usize] = b"/run/shm/\0";
pub const RC_PID_FILE: &[u8; 26usize] = b"/run/shm/robotcontrol.pid\0";
pub const FD_SETSIZE: u32 = 1024;
pub const ITIMER_REAL: u32 = 0;
pub const ITIMER_VIRTUAL: u32 = 1;
pub const ITIMER_PROF: u32 = 2;
pub const RC_LIB_VERSION_MAJOR: u32 = 1;
pub const RC_LIB_VERSION_MINOR: u32 = 0;
pub const RC_LIB_VERSION_PATCH: u32 = 5;
pub const RC_LIB_VERSION_HEX: u32 = 65541;
extern "C" {
    pub fn rc_adc_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_adc_cleanup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_adc_read_raw(ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_adc_read_volt(ch: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rc_adc_batt() -> f64;
}
extern "C" {
    pub fn rc_adc_dc_jack() -> f64;
}
pub const rc_bmp_oversample_t_BMP_OVERSAMPLE_1: rc_bmp_oversample_t = 4;
pub const rc_bmp_oversample_t_BMP_OVERSAMPLE_2: rc_bmp_oversample_t = 8;
pub const rc_bmp_oversample_t_BMP_OVERSAMPLE_4: rc_bmp_oversample_t = 12;
pub const rc_bmp_oversample_t_BMP_OVERSAMPLE_8: rc_bmp_oversample_t = 16;
pub const rc_bmp_oversample_t_BMP_OVERSAMPLE_16: rc_bmp_oversample_t = 20;
pub type rc_bmp_oversample_t = ::std::os::raw::c_uint;
pub const rc_bmp_filter_t_BMP_FILTER_OFF: rc_bmp_filter_t = 0;
pub const rc_bmp_filter_t_BMP_FILTER_2: rc_bmp_filter_t = 4;
pub const rc_bmp_filter_t_BMP_FILTER_4: rc_bmp_filter_t = 8;
pub const rc_bmp_filter_t_BMP_FILTER_8: rc_bmp_filter_t = 12;
pub const rc_bmp_filter_t_BMP_FILTER_16: rc_bmp_filter_t = 16;
pub type rc_bmp_filter_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct rc_bmp_data_t {
    pub temp_c: f64,
    pub alt_m: f64,
    pub pressure_pa: f64,
}
#[test]
fn bindgen_test_layout_rc_bmp_data_t() {
    const UNINIT: ::std::mem::MaybeUninit<rc_bmp_data_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rc_bmp_data_t>(),
        24usize,
        concat!("Size of: ", stringify!(rc_bmp_data_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rc_bmp_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rc_bmp_data_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temp_c) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rc_bmp_data_t), "::", stringify!(temp_c))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt_m) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rc_bmp_data_t), "::", stringify!(alt_m))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pressure_pa) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_bmp_data_t),
            "::",
            stringify!(pressure_pa)
        )
    );
}
extern "C" {
    pub fn rc_bmp_init(oversample: rc_bmp_oversample_t, filter: rc_bmp_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_bmp_set_sea_level_pressure_pa(pa: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_bmp_power_off() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_bmp_read(data: *mut rc_bmp_data_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_button_init(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        polarity: ::std::os::raw::c_char,
        debounce_us: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_button_cleanup();
}
extern "C" {
    pub fn rc_button_set_callbacks(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        press_func: ::std::option::Option<unsafe extern "C" fn()>,
        release_func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_button_get_state(chip: ::std::os::raw::c_int, pin: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_button_wait_for_event(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        press_or_release: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub const rc_governor_t_RC_GOV_POWERSAVE: rc_governor_t = 0;
pub const rc_governor_t_RC_GOV_PERFORMANCE: rc_governor_t = 1;
pub const rc_governor_t_RC_GOV_ONDEMAND: rc_governor_t = 2;
pub const rc_governor_t_RC_GOV_SCHEDUTIL: rc_governor_t = 3;
pub const rc_governor_t_RC_GOV_CONSERVATIVE: rc_governor_t = 4;
pub type rc_governor_t = ::std::os::raw::c_uint;
extern "C" {
    pub fn rc_cpu_set_governor(gov: rc_governor_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_cpu_get_freq() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_cpu_print_freq() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_initialize() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_cleanup() -> ::std::os::raw::c_int;
}
pub const rc_button_state_t_RELEASED: rc_button_state_t = 0;
pub const rc_button_state_t_PRESSED: rc_button_state_t = 1;
pub type rc_button_state_t = ::std::os::raw::c_uint;
extern "C" {
    pub fn rc_set_pause_pressed_func(func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_pause_released_func(func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_mode_pressed_func(func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_mode_released_func(func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_get_pause_button() -> rc_button_state_t;
}
extern "C" {
    pub fn rc_get_mode_button() -> rc_button_state_t;
}
extern "C" {
    pub fn rc_get_encoder_pos(ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_encoder_pos(ch: ::std::os::raw::c_int, value: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_enable_motors() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_disable_motors() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_motor(motor: ::std::os::raw::c_int, duty: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_motor_all(duty: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_motor_free_spin(motor: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_motor_free_spin_all() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_motor_brake(motor: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_set_motor_brake_all() -> ::std::os::raw::c_int;
}
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = i8;
pub type int_fast64_t = i64;
pub type int_least8_t = i8;
pub type int_least16_t = i16;
pub type int_least32_t = i32;
pub type int_least64_t = i64;
pub type uint_fast8_t = u8;
pub type uint_fast64_t = u64;
pub type uint_least8_t = u8;
pub type uint_least16_t = u16;
pub type uint_least32_t = u32;
pub type uint_least64_t = u64;
pub type int_fast16_t = i32;
pub type int_fast32_t = i32;
pub type uint_fast16_t = u32;
pub type uint_fast32_t = u32;
extern "C" {
    pub fn rc_dsm_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_cleanup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_ch_raw(ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_ch_normalized(ch: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rc_dsm_is_new_data() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_set_callback(func: ::std::option::Option<unsafe extern "C" fn()>);
}
extern "C" {
    pub fn rc_dsm_set_disconnect_callback(func: ::std::option::Option<unsafe extern "C" fn()>);
}
extern "C" {
    pub fn rc_dsm_is_connection_active() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_nanos_since_last_packet() -> i64;
}
extern "C" {
    pub fn rc_dsm_resolution() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_channels() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_bind_routine() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_dsm_calibrate_routine() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_eqep_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_eqep_cleanup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_eqep_read(ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_eqep_write(ch: ::std::os::raw::c_int, pos: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_pru_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_pru_cleanup();
}
extern "C" {
    pub fn rc_encoder_pru_read() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_pru_write(pos: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_init() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_cleanup() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_read(ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_encoder_write(ch: ::std::os::raw::c_int, pos: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_gpio_init(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        handle_flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_gpio_set_value(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        value: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_gpio_get_value(chip: ::std::os::raw::c_int, pin: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_gpio_init_event(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        handle_flags: ::std::os::raw::c_int,
        event_flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_gpio_poll(
        chip: ::std::os::raw::c_int,
        pin: ::std::os::raw::c_int,
        timeout_ms: ::std::os::raw::c_int,
        event_time_ns: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_gpio_cleanup(chip: ::std::os::raw::c_int, pin: ::std::os::raw::c_int);
}
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __ll: ::std::os::raw::c_longlong,
    pub __ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ll) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(max_align_t), "::", stringify!(__ll))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ld) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(max_align_t), "::", stringify!(__ld))
    );
}
extern "C" {
    pub fn rc_i2c_init(bus: ::std::os::raw::c_int, devAddr: u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_close(bus: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_set_device_address(bus: ::std::os::raw::c_int, devAddr: u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_read_byte(bus: ::std::os::raw::c_int, regAddr: u8, data: *mut u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_read_bytes(
        bus: ::std::os::raw::c_int,
        regAddr: u8,
        count: usize,
        data: *mut u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_read_word(bus: ::std::os::raw::c_int, regAddr: u8, data: *mut u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_read_words(
        bus: ::std::os::raw::c_int,
        regAddr: u8,
        count: usize,
        data: *mut u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_write_byte(bus: ::std::os::raw::c_int, regAddr: u8, data: u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_write_bytes(
        bus: ::std::os::raw::c_int,
        regAddr: u8,
        count: usize,
        data: *mut u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_write_word(bus: ::std::os::raw::c_int, regAddr: u8, data: u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_write_words(
        bus: ::std::os::raw::c_int,
        regAddr: u8,
        count: usize,
        data: *mut u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_send_bytes(bus: ::std::os::raw::c_int, count: usize, data: *mut u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_send_byte(bus: ::std::os::raw::c_int, data: u8) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_lock_bus(bus: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_unlock_bus(bus: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_get_lock(bus: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_i2c_get_fd(bus: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub const rc_led_t_RC_LED_GREEN: rc_led_t = 0;
pub const rc_led_t_RC_LED_RED: rc_led_t = 1;
pub const rc_led_t_RC_LED_USR0: rc_led_t = 2;
pub const rc_led_t_RC_LED_USR1: rc_led_t = 3;
pub const rc_led_t_RC_LED_USR2: rc_led_t = 4;
pub const rc_led_t_RC_LED_USR3: rc_led_t = 5;
pub const rc_led_t_RC_LED_BAT25: rc_led_t = 6;
pub const rc_led_t_RC_LED_BAT50: rc_led_t = 7;
pub const rc_led_t_RC_LED_BAT75: rc_led_t = 8;
pub const rc_led_t_RC_LED_BAT100: rc_led_t = 9;
pub const rc_led_t_RC_LED_WIFI: rc_led_t = 10;
pub type rc_led_t = ::std::os::raw::c_uint;
extern "C" {
    pub fn rc_led_set(led: rc_led_t, value: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_led_cleanup();
}
extern "C" {
    pub fn rc_led_get(led: rc_led_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_led_blink(led: rc_led_t, hz: f32, duration: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_led_stop_blink(led: rc_led_t);
}
extern "C" {
    pub fn rc_led_stop_blink_all();
}
extern "C" {
    pub static mut zero_tolerance: f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rc_vector_t {
    pub len: ::std::os::raw::c_int,
    pub d: *mut f64,
    pub initialized: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rc_vector_t() {
    const UNINIT: ::std::mem::MaybeUninit<rc_vector_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rc_vector_t>(),
        12usize,
        concat!("Size of: ", stringify!(rc_vector_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rc_vector_t>(),
        4usize,
        concat!("Alignment of ", stringify!(rc_vector_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rc_vector_t), "::", stringify!(len))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(rc_vector_t), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_vector_t),
            "::",
            stringify!(initialized)
        )
    );
}
impl Default for rc_vector_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn rc_vector_empty() -> rc_vector_t;
}
extern "C" {
    pub fn rc_vector_alloc(v: *mut rc_vector_t, length: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_free(v: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_zeros(v: *mut rc_vector_t, length: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_ones(v: *mut rc_vector_t, length: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_random(v: *mut rc_vector_t, length: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_fibonnaci(v: *mut rc_vector_t, length: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_from_array(
        v: *mut rc_vector_t,
        ptr: *mut f64,
        length: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_duplicate(a: rc_vector_t, b: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_print(v: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_print_sci(v: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_zero_out(v: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_times_scalar(v: *mut rc_vector_t, s: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_norm(v: rc_vector_t, p: f64) -> f64;
}
extern "C" {
    pub fn rc_vector_max(v: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_min(v: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_std_dev(v: rc_vector_t) -> f64;
}
extern "C" {
    pub fn rc_vector_mean(v: rc_vector_t) -> f64;
}
extern "C" {
    pub fn rc_vector_projection(v: rc_vector_t, e: rc_vector_t, p: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_dot_product(v1: rc_vector_t, v2: rc_vector_t) -> f64;
}
extern "C" {
    pub fn rc_vector_cross_product(v1: rc_vector_t, v2: rc_vector_t, p: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_sum(v1: rc_vector_t, v2: rc_vector_t, s: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_sum_inplace(v1: *mut rc_vector_t, v2: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_vector_subtract(v1: rc_vector_t, v2: rc_vector_t, s: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rc_matrix_t {
    pub rows: ::std::os::raw::c_int,
    pub cols: ::std::os::raw::c_int,
    pub d: *mut *mut f64,
    pub initialized: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rc_matrix_t() {
    const UNINIT: ::std::mem::MaybeUninit<rc_matrix_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rc_matrix_t>(),
        16usize,
        concat!("Size of: ", stringify!(rc_matrix_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rc_matrix_t>(),
        4usize,
        concat!("Alignment of ", stringify!(rc_matrix_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rows) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rc_matrix_t), "::", stringify!(rows))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cols) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(rc_matrix_t), "::", stringify!(cols))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rc_matrix_t), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_matrix_t),
            "::",
            stringify!(initialized)
        )
    );
}
impl Default for rc_matrix_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn rc_matrix_empty() -> rc_matrix_t;
}
extern "C" {
    pub fn rc_matrix_alloc(
        A: *mut rc_matrix_t,
        rows: ::std::os::raw::c_int,
        cols: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_free(A: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_zeros(
        A: *mut rc_matrix_t,
        rows: ::std::os::raw::c_int,
        cols: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_identity(A: *mut rc_matrix_t, dim: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_random(
        A: *mut rc_matrix_t,
        rows: ::std::os::raw::c_int,
        cols: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_diagonal(A: *mut rc_matrix_t, v: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_duplicate(A: rc_matrix_t, B: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_print(A: rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_print_sci(A: rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_zero_out(A: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_times_scalar(A: *mut rc_matrix_t, s: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_multiply(A: rc_matrix_t, B: rc_matrix_t, C: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_left_multiply_inplace(A: rc_matrix_t, B: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_right_multiply_inplace(A: *mut rc_matrix_t, B: rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_add(A: rc_matrix_t, B: rc_matrix_t, C: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_add_inplace(A: *mut rc_matrix_t, B: rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_subtract_inplace(A: *mut rc_matrix_t, B: rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_transpose(A: rc_matrix_t, T: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_transpose_inplace(A: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_times_col_vec(A: rc_matrix_t, v: rc_vector_t, c: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_row_vec_times_matrix(v: rc_vector_t, A: rc_matrix_t, c: *mut rc_vector_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_outer_product(v1: rc_vector_t, v2: rc_vector_t, A: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_matrix_determinant(A: rc_matrix_t) -> f64;
}
extern "C" {
    pub fn rc_matrix_symmetrize(P: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_lup_decomp(
        A: rc_matrix_t,
        L: *mut rc_matrix_t,
        U: *mut rc_matrix_t,
        P: *mut rc_matrix_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_qr_decomp(A: rc_matrix_t, Q: *mut rc_matrix_t, R: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_invert_matrix(A: rc_matrix_t, Ainv: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_invert_matrix_inplace(A: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_lin_system_solve(A: rc_matrix_t, b: rc_vector_t, x: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_set_zero_tolerance(tol: f64);
}
extern "C" {
    pub fn rc_algebra_lin_system_solve_qr(A: rc_matrix_t, b: rc_vector_t, x: *mut rc_vector_t)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_algebra_fit_ellipsoid(
        points: rc_matrix_t,
        center: *mut rc_vector_t,
        lengths: *mut rc_vector_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rc_ringbuf_t {
    pub d: *mut f64,
    pub size: ::std::os::raw::c_int,
    pub index: ::std::os::raw::c_int,
    pub initialized: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rc_ringbuf_t() {
    const UNINIT: ::std::mem::MaybeUninit<rc_ringbuf_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rc_ringbuf_t>(),
        16usize,
        concat!("Size of: ", stringify!(rc_ringbuf_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rc_ringbuf_t>(),
        4usize,
        concat!("Alignment of ", stringify!(rc_ringbuf_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rc_ringbuf_t), "::", stringify!(d))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(rc_ringbuf_t), "::", stringify!(size))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rc_ringbuf_t), "::", stringify!(index))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_ringbuf_t),
            "::",
            stringify!(initialized)
        )
    );
}
impl Default for rc_ringbuf_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn rc_ringbuf_empty() -> rc_ringbuf_t;
}
extern "C" {
    pub fn rc_ringbuf_alloc(buf: *mut rc_ringbuf_t, size: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_ringbuf_free(buf: *mut rc_ringbuf_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_ringbuf_reset(buf: *mut rc_ringbuf_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_ringbuf_insert(buf: *mut rc_ringbuf_t, val: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_ringbuf_get_value(buf: *mut rc_ringbuf_t, position: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rc_ringbuf_std_dev(buf: rc_ringbuf_t) -> f64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rc_filter_t {
    pub order: ::std::os::raw::c_int,
    pub dt: f64,
    pub gain: f64,
    pub num: rc_vector_t,
    pub den: rc_vector_t,
    pub sat_en: ::std::os::raw::c_int,
    pub sat_min: f64,
    pub sat_max: f64,
    pub sat_flag: ::std::os::raw::c_int,
    pub ss_en: ::std::os::raw::c_int,
    pub ss_steps: f64,
    pub in_buf: rc_ringbuf_t,
    pub out_buf: rc_ringbuf_t,
    pub newest_input: f64,
    pub newest_output: f64,
    pub step: u64,
    pub initialized: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_rc_filter_t() {
    const UNINIT: ::std::mem::MaybeUninit<rc_filter_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rc_filter_t>(),
        152usize,
        concat!("Size of: ", stringify!(rc_filter_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rc_filter_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rc_filter_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(order))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dt) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(dt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gain) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(gain))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        24usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(num))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).den) as usize - ptr as usize },
        36usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(den))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sat_en) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(sat_en))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sat_min) as usize - ptr as usize },
        56usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(sat_min))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sat_max) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(sat_max))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sat_flag) as usize - ptr as usize },
        72usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(sat_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_en) as usize - ptr as usize },
        76usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(ss_en))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_steps) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(ss_steps))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).in_buf) as usize - ptr as usize },
        88usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(in_buf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).out_buf) as usize - ptr as usize },
        104usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(out_buf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).newest_input) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_filter_t),
            "::",
            stringify!(newest_input)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).newest_output) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_filter_t),
            "::",
            stringify!(newest_output)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        136usize,
        concat!("Offset of field: ", stringify!(rc_filter_t), "::", stringify!(step))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_filter_t),
            "::",
            stringify!(initialized)
        )
    );
}
impl Default for rc_filter_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn rc_filter_empty() -> rc_filter_t;
}
extern "C" {
    pub fn rc_filter_alloc(f: *mut rc_filter_t, num: rc_vector_t, den: rc_vector_t, dt: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_alloc_from_arrays(
        f: *mut rc_filter_t,
        dt: f64,
        num: *mut f64,
        numlen: ::std::os::raw::c_int,
        den: *mut f64,
        denlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_duplicate(f: *mut rc_filter_t, old: rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_free(f: *mut rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_print(f: rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_march(f: *mut rc_filter_t, new_input: f64) -> f64;
}
extern "C" {
    pub fn rc_filter_reset(f: *mut rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_enable_saturation(f: *mut rc_filter_t, min: f64, max: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_get_saturation_flag(f: *mut rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_enable_soft_start(f: *mut rc_filter_t, seconds: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_previous_input(f: *mut rc_filter_t, steps: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rc_filter_previous_output(f: *mut rc_filter_t, steps: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rc_filter_prefill_inputs(f: *mut rc_filter_t, in_: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_prefill_outputs(f: *mut rc_filter_t, out: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_multiply(f1: rc_filter_t, f2: rc_filter_t, out: *mut rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_multiply_three(
        f1: rc_filter_t,
        f2: rc_filter_t,
        f3: rc_filter_t,
        out: *mut rc_filter_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_c2d_tustin(
        f: *mut rc_filter_t,
        dt: f64,
        num: rc_vector_t,
        den: rc_vector_t,
        w: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_normalize(f: *mut rc_filter_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_first_order_lowpass(f: *mut rc_filter_t, dt: f64, tc: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_first_order_highpass(f: *mut rc_filter_t, dt: f64, tc: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_butterworth_lowpass(
        f: *mut rc_filter_t,
        order: ::std::os::raw::c_int,
        dt: f64,
        wc: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_butterworth_highpass(
        f: *mut rc_filter_t,
        order: ::std::os::raw::c_int,
        dt: f64,
        wc: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_moving_average(
        f: *mut rc_filter_t,
        samples: ::std::os::raw::c_int,
        dt: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_integrator(f: *mut rc_filter_t, dt: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_double_integrator(f: *mut rc_filter_t, dt: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_pid(f: *mut rc_filter_t, kp: f64, ki: f64, kd: f64, Tf: f64, dt: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_filter_third_order_complement(
        lp: *mut rc_filter_t,
        hp: *mut rc_filter_t,
        freq: f64,
        damp: f64,
        dt: f64,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct rc_kalman_t {
    pub F: rc_matrix_t,
    pub G: rc_matrix_t,
    pub H: rc_matrix_t,
    pub Q: rc_matrix_t,
    pub R: rc_matrix_t,
    pub P: rc_matrix_t,
    pub Pi: rc_matrix_t,
    pub x_est: rc_vector_t,
    pub x_pre: rc_vector_t,
    pub initialized: ::std::os::raw::c_int,
    pub step: u64,
}
#[test]
fn bindgen_test_layout_rc_kalman_t() {
    const UNINIT: ::std::mem::MaybeUninit<rc_kalman_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rc_kalman_t>(),
        152usize,
        concat!("Size of: ", stringify!(rc_kalman_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rc_kalman_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rc_kalman_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).F) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(F))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).G) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(G))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).H) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(H))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Q) as usize - ptr as usize },
        48usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(Q))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).R) as usize - ptr as usize },
        64usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(R))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).P) as usize - ptr as usize },
        80usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(P))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Pi) as usize - ptr as usize },
        96usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(Pi))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_est) as usize - ptr as usize },
        112usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(x_est))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_pre) as usize - ptr as usize },
        124usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(x_pre))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialized) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(rc_kalman_t),
            "::",
            stringify!(initialized)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        144usize,
        concat!("Offset of field: ", stringify!(rc_kalman_t), "::", stringify!(step))
    );
}
impl Default for rc_kalman_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn rc_kalman_empty() -> rc_kalman_t;
}
extern "C" {
    pub fn rc_kalman_alloc_lin(
        kf: *mut rc_kalman_t,
        F: rc_matrix_t,
        G: rc_matrix_t,
        H: rc_matrix_t,
        Q: rc_matrix_t,
        R: rc_matrix_t,
        Pi: rc_matrix_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_kalman_alloc_ekf(
        kf: *mut rc_kalman_t,
        Q: rc_matrix_t,
        R: rc_matrix_t,
        Pi: rc_matrix_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_kalman_free(kf: *mut rc_kalman_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_kalman_reset(kf: *mut rc_kalman_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_kalman_update_lin(kf: *mut rc_kalman_t, u: rc_vector_t, y: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_kalman_update_ekf(
        kf: *mut rc_kalman_t,
        F: rc_matrix_t,
        H: rc_matrix_t,
        x_pre: rc_vector_t,
        y: rc_vector_t,
        h: rc_vector_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_get_random_float() -> f32;
}
extern "C" {
    pub fn rc_get_random_double() -> f64;
}
extern "C" {
    pub fn rc_saturate_float(val: *mut f32, min: f32, max: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_saturate_double(val: *mut f64, min: f64, max: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_print(v: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_conv(a: rc_vector_t, b: rc_vector_t, c: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_power(a: rc_vector_t, n: ::std::os::raw::c_int, b: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_add(a: rc_vector_t, b: rc_vector_t, c: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_add_inplace(a: *mut rc_vector_t, b: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_subtract(a: rc_vector_t, b: rc_vector_t, c: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_subtract_inplace(a: *mut rc_vector_t, b: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_differentiate(
        a: rc_vector_t,
        d: ::std::os::raw::c_int,
        b: *mut rc_vector_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_divide(
        n: rc_vector_t,
        d: rc_vector_t,
        div: *mut rc_vector_t,
        rem: *mut rc_vector_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_poly_butter(N: ::std::os::raw::c_int, wc: f64, b: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_norm(q: rc_vector_t) -> f64;
}
extern "C" {
    pub fn rc_quaternion_norm_array(q: *mut f64) -> f64;
}
extern "C" {
    pub fn rc_normalize_quaternion(q: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_normalize_quaternion_array(q: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_to_tb(q: rc_vector_t, tb: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_to_tb_array(q: *mut f64, tb: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_from_tb(tb: rc_vector_t, q: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_from_tb_array(tb: *mut f64, q: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_conjugate(q: rc_vector_t, c: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_conjugate_inplace(q: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_conjugate_array(q: *mut f64, c: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_conjugate_array_inplace(q: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_imaginary_part(q: rc_vector_t, img: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_multiply(a: rc_vector_t, b: rc_vector_t, c: *mut rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_multiply_array(a: *mut f64, b: *mut f64, c: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_rotate(p: *mut rc_vector_t, q: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_rotate_array(p: *mut f64, q: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_rotate_vector(v: *mut rc_vector_t, q: rc_vector_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_rotate_vector_array(v: *mut f64, q: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rc_quaternion_to_rotation_matrix(q: rc_vector_t, m: *mut rc_matrix_t) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    _unused: [u8; 0],
}
pub type locale_t = *mut __locale_struct;
extern "C" {
    pub fn memcpy(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strchr(arg1: *const ::std::os::raw::c_char, arg2: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(arg1: *const ::std::os::raw::c_char, arg2: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strspn(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strpbrk(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strerror(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(arg1: *const ::std::os::raw::c_void, arg2: *mut ::std::os::raw::c_void, arg3: usize);
}
extern "C" {
    pub fn bzero(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn index(arg1: *const ::std::os::raw::c_char, arg2: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(arg1: *const ::std::os::raw::c_char, arg2: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(arg1: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(arg1: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strtok_r(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_r(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stpcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(arg1: *const ::std::os::raw::c_char, arg2: usize) -> usize;
}
extern "C" {
    pub fn strdup(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(arg1: *const ::std::os::raw::c_char, arg2: ::std::os::raw::c_uint) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(arg1: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strerror_l(arg1: ::std::os::raw::c_int, arg2: locale_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcoll_l(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn memccpy(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlcat(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strlcpy(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn explicit_bzero(arg1: *mut ::std::os::raw::c_void, arg2: usize);
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct param_union {
    pub __bindgen_anon_1: param_union__bindgen_ty_1,
    pub type_: u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union param_union__bindgen_ty_1 {
    pub param_float: f32,
    pub param_int32: i32,
    pub param_uint32: u32,
    pub param_int16: i16,
    pub param_uint16: u16,
    pub param_int8: i8,
    pub param_uint8: u8,
    pub bytes: [u8; 4usize],
}
#[test]
fn bindgen_test_layout_param_union__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<param_union__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<param_union__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(param_union__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<param_union__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(param_union__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_float) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_float)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_int32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_int32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_uint32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_uint32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_int16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_int16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_uint16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_uint16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_int8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_int8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_uint8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(param_uint8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union__bindgen_ty_1),
            "::",
            stringify!(bytes)
        )
    );
}
impl Default for param_union__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_param_union() {
    const UNINIT: ::std::mem::MaybeUninit<param_union> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<param_union>(),
        5usize,
        concat!("Size of: ", stringify!(param_union))
    );
    assert_eq!(
        ::std::mem::align_of::<param_union>(),
        1usize,
        concat!("Alignment of ", stringify!(param_union))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!("Offset of field: ", stringify!(param_union), "::", stringify!(type_))
    );
}
impl Default for param_union {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mavlink_param_union_t = param_union;
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct param_union_extended {
    pub __bindgen_anon_1: param_union_extended__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union param_union_extended__bindgen_ty_1 {
    pub __bindgen_anon_1: param_union_extended__bindgen_ty_1__bindgen_ty_1,
    pub data: [u8; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct param_union_extended__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub __bindgen_anon_1: param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub c: ::std::os::raw::c_char,
    pub uint8: u8,
    pub int8: i8,
    pub uint16: u16,
    pub int16: i16,
    pub uint32: u32,
    pub int32: i32,
    pub f: f32,
    pub align: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(uint8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(int8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(uint16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(int16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(uint32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(int32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(align)
        )
    );
}
impl Default for param_union_extended__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_param_union_extended__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<param_union_extended__bindgen_ty_1__bindgen_ty_1>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<param_union_extended__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(param_union_extended__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl Default for param_union_extended__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl param_union_extended__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn is_double(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_double(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn mavlink_type(&self) -> u8 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_mavlink_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(is_double: u8, mavlink_type: u8) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let is_double: u8 = unsafe { ::std::mem::transmute(is_double) };
            is_double as u64
        });
        __bindgen_bitfield_unit.set(1usize, 7u8, {
            let mavlink_type: u8 = unsafe { ::std::mem::transmute(mavlink_type) };
            mavlink_type as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_param_union_extended__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<param_union_extended__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<param_union_extended__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(param_union_extended__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<param_union_extended__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(param_union_extended__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(param_union_extended__bindgen_ty_1),
            "::",
            stringify!(data)
        )
    );
}
impl Default for param_union_extended__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_param_union_extended() {
    assert_eq!(
        ::std::mem::size_of::<param_union_extended>(),
        12usize,
        concat!("Size of: ", stringify!(param_union_extended))
    );
    assert_eq!(
        ::std::mem::align_of::<param_union_extended>(),
        1usize,
        concat!("Alignment of ", stringify!(param_union_extended))
    );
}
impl Default for param_union_extended {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mavlink_param_union_double_t = param_union_extended;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_system {
    pub sysid: u8,
    pub compid: u8,
}
#[test]
fn bindgen_test_layout___mavlink_system() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_system> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_system>(),
        2usize,
        concat!("Size of: ", stringify!(__mavlink_system))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_system>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_system))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sysid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_system),
            "::",
            stringify!(sysid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compid) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_system),
            "::",
            stringify!(compid)
        )
    );
}
pub type mavlink_system_t = __mavlink_system;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct __mavlink_message {
    pub checksum: u16,
    pub magic: u8,
    pub len: u8,
    pub incompat_flags: u8,
    pub compat_flags: u8,
    pub seq: u8,
    pub sysid: u8,
    pub compid: u8,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 3usize]>,
    pub payload64: [u64; 33usize],
    pub ck: [u8; 2usize],
    pub signature: [u8; 13usize],
}
#[test]
fn bindgen_test_layout___mavlink_message() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_message> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_message>(),
        291usize,
        concat!("Size of: ", stringify!(__mavlink_message))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_message>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_message))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).checksum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(checksum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).magic) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).incompat_flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(incompat_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compat_flags) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(compat_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sysid) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(sysid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(compid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).payload64) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(payload64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ck) as usize - ptr as usize },
        276usize,
        concat!("Offset of field: ", stringify!(__mavlink_message), "::", stringify!(ck))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signature) as usize - ptr as usize },
        278usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message),
            "::",
            stringify!(signature)
        )
    );
}
impl Default for __mavlink_message {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
impl __mavlink_message {
    #[inline]
    pub fn msgid(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 24u8) as u32) }
    }
    #[inline]
    pub fn set_msgid(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 24u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(msgid: u32) -> __BindgenBitfieldUnit<[u8; 3usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 3usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 24u8, {
            let msgid: u32 = unsafe { ::std::mem::transmute(msgid) };
            msgid as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type mavlink_message_t = __mavlink_message;
pub const mavlink_message_type_t_MAVLINK_TYPE_CHAR: mavlink_message_type_t = 0;
pub const mavlink_message_type_t_MAVLINK_TYPE_UINT8_T: mavlink_message_type_t = 1;
pub const mavlink_message_type_t_MAVLINK_TYPE_INT8_T: mavlink_message_type_t = 2;
pub const mavlink_message_type_t_MAVLINK_TYPE_UINT16_T: mavlink_message_type_t = 3;
pub const mavlink_message_type_t_MAVLINK_TYPE_INT16_T: mavlink_message_type_t = 4;
pub const mavlink_message_type_t_MAVLINK_TYPE_UINT32_T: mavlink_message_type_t = 5;
pub const mavlink_message_type_t_MAVLINK_TYPE_INT32_T: mavlink_message_type_t = 6;
pub const mavlink_message_type_t_MAVLINK_TYPE_UINT64_T: mavlink_message_type_t = 7;
pub const mavlink_message_type_t_MAVLINK_TYPE_INT64_T: mavlink_message_type_t = 8;
pub const mavlink_message_type_t_MAVLINK_TYPE_FLOAT: mavlink_message_type_t = 9;
pub const mavlink_message_type_t_MAVLINK_TYPE_DOUBLE: mavlink_message_type_t = 10;
pub type mavlink_message_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mavlink_field_info {
    pub name: *const ::std::os::raw::c_char,
    pub print_format: *const ::std::os::raw::c_char,
    pub type_: mavlink_message_type_t,
    pub array_length: ::std::os::raw::c_uint,
    pub wire_offset: ::std::os::raw::c_uint,
    pub structure_offset: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___mavlink_field_info() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_field_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_field_info>(),
        24usize,
        concat!("Size of: ", stringify!(__mavlink_field_info))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_field_info>(),
        4usize,
        concat!("Alignment of ", stringify!(__mavlink_field_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_field_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).print_format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_field_info),
            "::",
            stringify!(print_format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_field_info),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).array_length) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_field_info),
            "::",
            stringify!(array_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wire_offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_field_info),
            "::",
            stringify!(wire_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).structure_offset) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_field_info),
            "::",
            stringify!(structure_offset)
        )
    );
}
impl Default for __mavlink_field_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mavlink_field_info_t = __mavlink_field_info;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mavlink_message_info {
    pub msgid: u32,
    pub name: *const ::std::os::raw::c_char,
    pub num_fields: ::std::os::raw::c_uint,
    pub fields: [mavlink_field_info_t; 64usize],
}
#[test]
fn bindgen_test_layout___mavlink_message_info() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_message_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_message_info>(),
        1548usize,
        concat!("Size of: ", stringify!(__mavlink_message_info))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_message_info>(),
        4usize,
        concat!("Alignment of ", stringify!(__mavlink_message_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msgid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message_info),
            "::",
            stringify!(msgid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_fields) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message_info),
            "::",
            stringify!(num_fields)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fields) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_message_info),
            "::",
            stringify!(fields)
        )
    );
}
impl Default for __mavlink_message_info {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mavlink_message_info_t = __mavlink_message_info;
pub const mavlink_channel_t_MAVLINK_COMM_0: mavlink_channel_t = 0;
pub const mavlink_channel_t_MAVLINK_COMM_1: mavlink_channel_t = 1;
pub const mavlink_channel_t_MAVLINK_COMM_2: mavlink_channel_t = 2;
pub const mavlink_channel_t_MAVLINK_COMM_3: mavlink_channel_t = 3;
pub type mavlink_channel_t = ::std::os::raw::c_uint;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_UNINIT: mavlink_parse_state_t = 0;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_IDLE: mavlink_parse_state_t = 1;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_STX: mavlink_parse_state_t = 2;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_LENGTH: mavlink_parse_state_t = 3;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_INCOMPAT_FLAGS: mavlink_parse_state_t = 4;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_COMPAT_FLAGS: mavlink_parse_state_t = 5;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_SEQ: mavlink_parse_state_t = 6;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_SYSID: mavlink_parse_state_t = 7;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_COMPID: mavlink_parse_state_t = 8;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_MSGID1: mavlink_parse_state_t = 9;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_MSGID2: mavlink_parse_state_t = 10;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_MSGID3: mavlink_parse_state_t = 11;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_PAYLOAD: mavlink_parse_state_t = 12;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_CRC1: mavlink_parse_state_t = 13;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_GOT_BAD_CRC1: mavlink_parse_state_t = 14;
pub const mavlink_parse_state_t_MAVLINK_PARSE_STATE_SIGNATURE_WAIT: mavlink_parse_state_t = 15;
pub type mavlink_parse_state_t = ::std::os::raw::c_uint;
pub const mavlink_framing_t_MAVLINK_FRAMING_INCOMPLETE: mavlink_framing_t = 0;
pub const mavlink_framing_t_MAVLINK_FRAMING_OK: mavlink_framing_t = 1;
pub const mavlink_framing_t_MAVLINK_FRAMING_BAD_CRC: mavlink_framing_t = 2;
pub const mavlink_framing_t_MAVLINK_FRAMING_BAD_SIGNATURE: mavlink_framing_t = 3;
pub type mavlink_framing_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __mavlink_status {
    pub msg_received: u8,
    pub buffer_overrun: u8,
    pub parse_error: u8,
    pub parse_state: mavlink_parse_state_t,
    pub packet_idx: u8,
    pub current_rx_seq: u8,
    pub current_tx_seq: u8,
    pub packet_rx_success_count: u16,
    pub packet_rx_drop_count: u16,
    pub flags: u8,
    pub signature_wait: u8,
    pub signing: *mut __mavlink_signing,
    pub signing_streams: *mut __mavlink_signing_streams,
}
#[test]
fn bindgen_test_layout___mavlink_status() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_status> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_status>(),
        28usize,
        concat!("Size of: ", stringify!(__mavlink_status))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_status>(),
        4usize,
        concat!("Alignment of ", stringify!(__mavlink_status))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_received) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(msg_received)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffer_overrun) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(buffer_overrun)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parse_error) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(parse_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parse_state) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(parse_state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packet_idx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(packet_idx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_rx_seq) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(current_rx_seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_tx_seq) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(current_tx_seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packet_rx_success_count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(packet_rx_success_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).packet_rx_drop_count) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(packet_rx_drop_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signature_wait) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(signature_wait)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signing) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(signing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).signing_streams) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_status),
            "::",
            stringify!(signing_streams)
        )
    );
}
impl Default for __mavlink_status {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mavlink_status_t = __mavlink_status;
pub type mavlink_accept_unsigned_t =
    ::std::option::Option<unsafe extern "C" fn(status: *const mavlink_status_t, msgid: u32) -> bool>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_signing {
    pub flags: u8,
    pub link_id: u8,
    pub timestamp: u64,
    pub secret_key: [u8; 32usize],
    pub accept_unsigned_callback: mavlink_accept_unsigned_t,
}
#[test]
fn bindgen_test_layout___mavlink_signing() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_signing> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_signing>(),
        56usize,
        concat!("Size of: ", stringify!(__mavlink_signing))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_signing>(),
        8usize,
        concat!("Alignment of ", stringify!(__mavlink_signing))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).link_id) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing),
            "::",
            stringify!(link_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).secret_key) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing),
            "::",
            stringify!(secret_key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).accept_unsigned_callback) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing),
            "::",
            stringify!(accept_unsigned_callback)
        )
    );
}
pub type mavlink_signing_t = __mavlink_signing;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_signing_streams {
    pub num_signing_streams: u16,
    pub stream: [__mavlink_signing_streams___mavlink_signing_stream; 16usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_signing_streams___mavlink_signing_stream {
    pub link_id: u8,
    pub sysid: u8,
    pub compid: u8,
    pub timestamp_bytes: [u8; 6usize],
}
#[test]
fn bindgen_test_layout___mavlink_signing_streams___mavlink_signing_stream() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_signing_streams___mavlink_signing_stream> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_signing_streams___mavlink_signing_stream>(),
        9usize,
        concat!(
            "Size of: ",
            stringify!(__mavlink_signing_streams___mavlink_signing_stream)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_signing_streams___mavlink_signing_stream>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(__mavlink_signing_streams___mavlink_signing_stream)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).link_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing_streams___mavlink_signing_stream),
            "::",
            stringify!(link_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sysid) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing_streams___mavlink_signing_stream),
            "::",
            stringify!(sysid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compid) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing_streams___mavlink_signing_stream),
            "::",
            stringify!(compid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timestamp_bytes) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing_streams___mavlink_signing_stream),
            "::",
            stringify!(timestamp_bytes)
        )
    );
}
#[test]
fn bindgen_test_layout___mavlink_signing_streams() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_signing_streams> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_signing_streams>(),
        146usize,
        concat!("Size of: ", stringify!(__mavlink_signing_streams))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_signing_streams>(),
        2usize,
        concat!("Alignment of ", stringify!(__mavlink_signing_streams))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_signing_streams) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing_streams),
            "::",
            stringify!(num_signing_streams)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stream) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_signing_streams),
            "::",
            stringify!(stream)
        )
    );
}
pub type mavlink_signing_streams_t = __mavlink_signing_streams;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_msg_entry {
    pub msgid: u32,
    pub crc_extra: u8,
    pub msg_len: u8,
    pub flags: u8,
    pub target_system_ofs: u8,
    pub target_component_ofs: u8,
}
#[test]
fn bindgen_test_layout___mavlink_msg_entry() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_msg_entry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_msg_entry>(),
        12usize,
        concat!("Size of: ", stringify!(__mavlink_msg_entry))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_msg_entry>(),
        4usize,
        concat!("Alignment of ", stringify!(__mavlink_msg_entry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msgid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_msg_entry),
            "::",
            stringify!(msgid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crc_extra) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_msg_entry),
            "::",
            stringify!(crc_extra)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_len) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_msg_entry),
            "::",
            stringify!(msg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_msg_entry),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system_ofs) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_msg_entry),
            "::",
            stringify!(target_system_ofs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component_ofs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_msg_entry),
            "::",
            stringify!(target_component_ofs)
        )
    );
}
pub type mavlink_msg_entry_t = __mavlink_msg_entry;
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassify(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __fpclassifyf(arg1: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __fpclassifyl(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbit(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitf(arg1: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitl(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acos(arg1: f64) -> f64;
}
extern "C" {
    pub fn acosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn acosl(arg1: f64) -> f64;
}
extern "C" {
    pub fn acosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn acoshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn acoshl(arg1: f64) -> f64;
}
extern "C" {
    pub fn asin(arg1: f64) -> f64;
}
extern "C" {
    pub fn asinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn asinl(arg1: f64) -> f64;
}
extern "C" {
    pub fn asinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn asinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn asinhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn atan(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atanl(arg1: f64) -> f64;
}
extern "C" {
    pub fn atan2(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn atan2f(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn atan2l(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn atanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn atanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn atanhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn cbrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn cbrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cbrtl(arg1: f64) -> f64;
}
extern "C" {
    pub fn ceil(arg1: f64) -> f64;
}
extern "C" {
    pub fn ceilf(arg1: f32) -> f32;
}
extern "C" {
    pub fn ceill(arg1: f64) -> f64;
}
extern "C" {
    pub fn copysign(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn copysignf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn copysignl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn cos(arg1: f64) -> f64;
}
extern "C" {
    pub fn cosf(arg1: f32) -> f32;
}
extern "C" {
    pub fn cosl(arg1: f64) -> f64;
}
extern "C" {
    pub fn cosh(arg1: f64) -> f64;
}
extern "C" {
    pub fn coshf(arg1: f32) -> f32;
}
extern "C" {
    pub fn coshl(arg1: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp(arg1: f64) -> f64;
}
extern "C" {
    pub fn expf(arg1: f32) -> f32;
}
extern "C" {
    pub fn expl(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp2(arg1: f64) -> f64;
}
extern "C" {
    pub fn exp2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn exp2l(arg1: f64) -> f64;
}
extern "C" {
    pub fn expm1(arg1: f64) -> f64;
}
extern "C" {
    pub fn expm1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn expm1l(arg1: f64) -> f64;
}
extern "C" {
    pub fn fabs(arg1: f64) -> f64;
}
extern "C" {
    pub fn fabsf(arg1: f32) -> f32;
}
extern "C" {
    pub fn fabsl(arg1: f64) -> f64;
}
extern "C" {
    pub fn fdim(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fdimf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fdiml(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn floor(arg1: f64) -> f64;
}
extern "C" {
    pub fn floorf(arg1: f32) -> f32;
}
extern "C" {
    pub fn floorl(arg1: f64) -> f64;
}
extern "C" {
    pub fn fma(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
extern "C" {
    pub fn fmaf(arg1: f32, arg2: f32, arg3: f32) -> f32;
}
extern "C" {
    pub fn fmal(arg1: f64, arg2: f64, arg3: f64) -> f64;
}
extern "C" {
    pub fn fmax(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmaxf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmaxl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmin(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fminf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fminl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmod(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn fmodf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn fmodl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn frexp(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn frexpf(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn frexpl(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn hypot(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn hypotf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn hypotl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn ilogb(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ilogbf(arg1: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ilogbl(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ldexp(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexpf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ldexpl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn llrint(arg1: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llrintf(arg1: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llrintl(arg1: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llround(arg1: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llroundf(arg1: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn llroundl(arg1: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn log(arg1: f64) -> f64;
}
extern "C" {
    pub fn logf(arg1: f32) -> f32;
}
extern "C" {
    pub fn logl(arg1: f64) -> f64;
}
extern "C" {
    pub fn log10(arg1: f64) -> f64;
}
extern "C" {
    pub fn log10f(arg1: f32) -> f32;
}
extern "C" {
    pub fn log10l(arg1: f64) -> f64;
}
extern "C" {
    pub fn log1p(arg1: f64) -> f64;
}
extern "C" {
    pub fn log1pf(arg1: f32) -> f32;
}
extern "C" {
    pub fn log1pl(arg1: f64) -> f64;
}
extern "C" {
    pub fn log2(arg1: f64) -> f64;
}
extern "C" {
    pub fn log2f(arg1: f32) -> f32;
}
extern "C" {
    pub fn log2l(arg1: f64) -> f64;
}
extern "C" {
    pub fn logb(arg1: f64) -> f64;
}
extern "C" {
    pub fn logbf(arg1: f32) -> f32;
}
extern "C" {
    pub fn logbl(arg1: f64) -> f64;
}
extern "C" {
    pub fn lrint(arg1: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lrintf(arg1: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lrintl(arg1: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lround(arg1: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lroundf(arg1: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn lroundl(arg1: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn modf(arg1: f64, arg2: *mut f64) -> f64;
}
extern "C" {
    pub fn modff(arg1: f32, arg2: *mut f32) -> f32;
}
extern "C" {
    pub fn modfl(arg1: f64, arg2: *mut f64) -> f64;
}
extern "C" {
    pub fn nan(arg1: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn nanf(arg1: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn nanl(arg1: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn nearbyint(arg1: f64) -> f64;
}
extern "C" {
    pub fn nearbyintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn nearbyintl(arg1: f64) -> f64;
}
extern "C" {
    pub fn nextafter(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nextafterf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn nextafterl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn nexttowardf(arg1: f32, arg2: f64) -> f32;
}
extern "C" {
    pub fn nexttowardl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn pow(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn powf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn powl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn remainder(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn remainderf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn remainderl(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn remquo(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn remquof(arg1: f32, arg2: f32, arg3: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn remquol(arg1: f64, arg2: f64, arg3: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rint(arg1: f64) -> f64;
}
extern "C" {
    pub fn rintf(arg1: f32) -> f32;
}
extern "C" {
    pub fn rintl(arg1: f64) -> f64;
}
extern "C" {
    pub fn round(arg1: f64) -> f64;
}
extern "C" {
    pub fn roundf(arg1: f32) -> f32;
}
extern "C" {
    pub fn roundl(arg1: f64) -> f64;
}
extern "C" {
    pub fn scalbln(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn scalblnf(arg1: f32, arg2: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn scalblnl(arg1: f64, arg2: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn scalbn(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn scalbnf(arg1: f32, arg2: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn scalbnl(arg1: f64, arg2: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn sin(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinl(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinh(arg1: f64) -> f64;
}
extern "C" {
    pub fn sinhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sinhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn sqrt(arg1: f64) -> f64;
}
extern "C" {
    pub fn sqrtf(arg1: f32) -> f32;
}
extern "C" {
    pub fn sqrtl(arg1: f64) -> f64;
}
extern "C" {
    pub fn tan(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanl(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanh(arg1: f64) -> f64;
}
extern "C" {
    pub fn tanhf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tanhl(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn trunc(arg1: f64) -> f64;
}
extern "C" {
    pub fn truncf(arg1: f32) -> f32;
}
extern "C" {
    pub fn truncl(arg1: f64) -> f64;
}
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn drem(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn dremf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn finite(arg1: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitef(arg1: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalb(arg1: f64, arg2: f64) -> f64;
}
extern "C" {
    pub fn scalbf(arg1: f32, arg2: f32) -> f32;
}
extern "C" {
    pub fn significand(arg1: f64) -> f64;
}
extern "C" {
    pub fn significandf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, arg2: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, arg2: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
pub type off_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    _unused: [u8; 0],
}
pub type FILE = _IO_FILE;
pub type va_list = u32;
pub type __isoc_va_list = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _G_fpos64_t {
    pub __opaque: [::std::os::raw::c_char; 16usize],
    pub __lldata: ::std::os::raw::c_longlong,
    pub __align: f64,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__opaque) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_G_fpos64_t), "::", stringify!(__opaque))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lldata) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_G_fpos64_t), "::", stringify!(__lldata))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(_G_fpos64_t), "::", stringify!(__align))
    );
}
impl Default for _G_fpos64_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type fpos_t = _G_fpos64_t;
extern "C" {
    pub static stdin: *mut FILE;
}
extern "C" {
    pub static stdout: *mut FILE;
}
extern "C" {
    pub static stderr: *mut FILE;
}
extern "C" {
    pub fn fopen(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn feof(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(arg1: *mut FILE);
}
extern "C" {
    pub fn fseek(arg1: *mut FILE, arg2: ::std::os::raw::c_long, arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(arg1: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(arg1: *mut FILE);
}
extern "C" {
    pub fn fgetpos(arg1: *mut FILE, arg2: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(arg1: *mut FILE, arg2: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        arg1: *mut ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn fwrite(
        arg1: *const ::std::os::raw::c_void,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
        arg4: *mut FILE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn fgetc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fputs(arg1: *const ::std::os::raw::c_char, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(arg1: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fprintf(arg1: *mut FILE, arg2: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_uint,
        arg3: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(arg1: *const ::std::os::raw::c_char, arg2: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(arg1: *mut FILE, arg2: *const ::std::os::raw::c_char, arg3: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_uint,
        arg3: *const ::std::os::raw::c_char,
        arg4: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(arg1: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(arg1: *mut FILE, arg2: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(arg1: *const ::std::os::raw::c_char, arg2: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(arg1: *mut FILE, arg2: *const ::std::os::raw::c_char, arg3: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        arg1: *mut FILE,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(arg1: *mut ::std::os::raw::c_void, arg2: usize, arg3: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn popen(arg1: *const ::std::os::raw::c_char, arg2: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseeko(arg1: *mut FILE, arg2: off_t, arg3: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(arg1: *mut FILE) -> off_t;
}
extern "C" {
    pub fn dprintf(arg1: ::std::os::raw::c_int, arg2: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: __isoc_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(arg1: *mut FILE);
}
extern "C" {
    pub fn getc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdelim(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut usize,
        arg3: ::std::os::raw::c_int,
        arg4: *mut FILE,
    ) -> isize;
}
extern "C" {
    pub fn getline(arg1: *mut *mut ::std::os::raw::c_char, arg2: *mut usize, arg3: *mut FILE) -> isize;
}
extern "C" {
    pub fn renameat(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        arg1: *const ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cuserid(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setlinebuf(arg1: *mut FILE);
}
extern "C" {
    pub fn setbuffer(arg1: *mut FILE, arg2: *mut ::std::os::raw::c_char, arg3: usize);
}
extern "C" {
    pub fn fgetc_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread_unlocked(arg1: *mut ::std::os::raw::c_void, arg2: usize, arg3: usize, arg4: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(arg1: *const ::std::os::raw::c_void, arg2: usize, arg3: usize, arg4: *mut FILE) -> usize;
}
extern "C" {
    pub fn clearerr_unlocked(arg1: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(arg1: ::std::os::raw::c_int, arg2: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetln(arg1: *mut FILE, arg2: *mut usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *const ::std::os::raw::c_char,
        arg3: __isoc_va_list,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct mavlink_sha256_ctx {
    pub sz: [::std::os::raw::c_uint; 2usize],
    pub counter: [u32; 8usize],
    pub u: mavlink_sha256_ctx__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union mavlink_sha256_ctx__bindgen_ty_1 {
    pub save_bytes: [::std::os::raw::c_uchar; 64usize],
    pub save_u32: [u32; 16usize],
}
#[test]
fn bindgen_test_layout_mavlink_sha256_ctx__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<mavlink_sha256_ctx__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mavlink_sha256_ctx__bindgen_ty_1>(),
        64usize,
        concat!("Size of: ", stringify!(mavlink_sha256_ctx__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<mavlink_sha256_ctx__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(mavlink_sha256_ctx__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).save_bytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mavlink_sha256_ctx__bindgen_ty_1),
            "::",
            stringify!(save_bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).save_u32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mavlink_sha256_ctx__bindgen_ty_1),
            "::",
            stringify!(save_u32)
        )
    );
}
impl Default for mavlink_sha256_ctx__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_mavlink_sha256_ctx() {
    const UNINIT: ::std::mem::MaybeUninit<mavlink_sha256_ctx> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<mavlink_sha256_ctx>(),
        104usize,
        concat!("Size of: ", stringify!(mavlink_sha256_ctx))
    );
    assert_eq!(
        ::std::mem::align_of::<mavlink_sha256_ctx>(),
        4usize,
        concat!("Alignment of ", stringify!(mavlink_sha256_ctx))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sz) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mavlink_sha256_ctx),
            "::",
            stringify!(sz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(mavlink_sha256_ctx),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        40usize,
        concat!("Offset of field: ", stringify!(mavlink_sha256_ctx), "::", stringify!(u))
    );
}
impl Default for mavlink_sha256_ctx {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub static mavlink_sha256_constant_256: [u32; 64usize];
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mavlink_bitfield {
    pub uint8: u8,
    pub int8: i8,
    pub uint16: u16,
    pub int16: i16,
    pub uint32: u32,
    pub int32: i32,
}
#[test]
fn bindgen_test_layout___mavlink_bitfield() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_bitfield> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_bitfield>(),
        4usize,
        concat!("Size of: ", stringify!(__mavlink_bitfield))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_bitfield>(),
        4usize,
        concat!("Alignment of ", stringify!(__mavlink_bitfield))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_bitfield),
            "::",
            stringify!(uint8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_bitfield),
            "::",
            stringify!(int8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_bitfield),
            "::",
            stringify!(uint16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_bitfield),
            "::",
            stringify!(int16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uint32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_bitfield),
            "::",
            stringify!(uint32)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).int32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_bitfield),
            "::",
            stringify!(int32)
        )
    );
}
impl Default for __mavlink_bitfield {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_GENERIC: MAV_AUTOPILOT = 0;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_RESERVED: MAV_AUTOPILOT = 1;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_SLUGS: MAV_AUTOPILOT = 2;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_ARDUPILOTMEGA: MAV_AUTOPILOT = 3;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_OPENPILOT: MAV_AUTOPILOT = 4;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_GENERIC_WAYPOINTS_ONLY: MAV_AUTOPILOT = 5;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_GENERIC_WAYPOINTS_AND_SIMPLE_NAVIGATION_ONLY: MAV_AUTOPILOT = 6;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_GENERIC_MISSION_FULL: MAV_AUTOPILOT = 7;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_INVALID: MAV_AUTOPILOT = 8;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_PPZ: MAV_AUTOPILOT = 9;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_UDB: MAV_AUTOPILOT = 10;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_FP: MAV_AUTOPILOT = 11;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_PX4: MAV_AUTOPILOT = 12;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_SMACCMPILOT: MAV_AUTOPILOT = 13;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_AUTOQUAD: MAV_AUTOPILOT = 14;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_ARMAZILA: MAV_AUTOPILOT = 15;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_AEROB: MAV_AUTOPILOT = 16;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_ASLUAV: MAV_AUTOPILOT = 17;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_SMARTAP: MAV_AUTOPILOT = 18;
pub const MAV_AUTOPILOT_MAV_AUTOPILOT_ENUM_END: MAV_AUTOPILOT = 19;
pub type MAV_AUTOPILOT = ::std::os::raw::c_uint;
pub const MAV_TYPE_MAV_TYPE_GENERIC: MAV_TYPE = 0;
pub const MAV_TYPE_MAV_TYPE_FIXED_WING: MAV_TYPE = 1;
pub const MAV_TYPE_MAV_TYPE_QUADROTOR: MAV_TYPE = 2;
pub const MAV_TYPE_MAV_TYPE_COAXIAL: MAV_TYPE = 3;
pub const MAV_TYPE_MAV_TYPE_HELICOPTER: MAV_TYPE = 4;
pub const MAV_TYPE_MAV_TYPE_ANTENNA_TRACKER: MAV_TYPE = 5;
pub const MAV_TYPE_MAV_TYPE_GCS: MAV_TYPE = 6;
pub const MAV_TYPE_MAV_TYPE_AIRSHIP: MAV_TYPE = 7;
pub const MAV_TYPE_MAV_TYPE_FREE_BALLOON: MAV_TYPE = 8;
pub const MAV_TYPE_MAV_TYPE_ROCKET: MAV_TYPE = 9;
pub const MAV_TYPE_MAV_TYPE_GROUND_ROVER: MAV_TYPE = 10;
pub const MAV_TYPE_MAV_TYPE_SURFACE_BOAT: MAV_TYPE = 11;
pub const MAV_TYPE_MAV_TYPE_SUBMARINE: MAV_TYPE = 12;
pub const MAV_TYPE_MAV_TYPE_HEXAROTOR: MAV_TYPE = 13;
pub const MAV_TYPE_MAV_TYPE_OCTOROTOR: MAV_TYPE = 14;
pub const MAV_TYPE_MAV_TYPE_TRICOPTER: MAV_TYPE = 15;
pub const MAV_TYPE_MAV_TYPE_FLAPPING_WING: MAV_TYPE = 16;
pub const MAV_TYPE_MAV_TYPE_KITE: MAV_TYPE = 17;
pub const MAV_TYPE_MAV_TYPE_ONBOARD_CONTROLLER: MAV_TYPE = 18;
pub const MAV_TYPE_MAV_TYPE_VTOL_DUOROTOR: MAV_TYPE = 19;
pub const MAV_TYPE_MAV_TYPE_VTOL_QUADROTOR: MAV_TYPE = 20;
pub const MAV_TYPE_MAV_TYPE_VTOL_TILTROTOR: MAV_TYPE = 21;
pub const MAV_TYPE_MAV_TYPE_VTOL_RESERVED2: MAV_TYPE = 22;
pub const MAV_TYPE_MAV_TYPE_VTOL_RESERVED3: MAV_TYPE = 23;
pub const MAV_TYPE_MAV_TYPE_VTOL_RESERVED4: MAV_TYPE = 24;
pub const MAV_TYPE_MAV_TYPE_VTOL_RESERVED5: MAV_TYPE = 25;
pub const MAV_TYPE_MAV_TYPE_GIMBAL: MAV_TYPE = 26;
pub const MAV_TYPE_MAV_TYPE_ADSB: MAV_TYPE = 27;
pub const MAV_TYPE_MAV_TYPE_PARAFOIL: MAV_TYPE = 28;
pub const MAV_TYPE_MAV_TYPE_DODECAROTOR: MAV_TYPE = 29;
pub const MAV_TYPE_MAV_TYPE_ENUM_END: MAV_TYPE = 30;
pub type MAV_TYPE = ::std::os::raw::c_uint;
pub const FIRMWARE_VERSION_TYPE_FIRMWARE_VERSION_TYPE_DEV: FIRMWARE_VERSION_TYPE = 0;
pub const FIRMWARE_VERSION_TYPE_FIRMWARE_VERSION_TYPE_ALPHA: FIRMWARE_VERSION_TYPE = 64;
pub const FIRMWARE_VERSION_TYPE_FIRMWARE_VERSION_TYPE_BETA: FIRMWARE_VERSION_TYPE = 128;
pub const FIRMWARE_VERSION_TYPE_FIRMWARE_VERSION_TYPE_RC: FIRMWARE_VERSION_TYPE = 192;
pub const FIRMWARE_VERSION_TYPE_FIRMWARE_VERSION_TYPE_OFFICIAL: FIRMWARE_VERSION_TYPE = 255;
pub const FIRMWARE_VERSION_TYPE_FIRMWARE_VERSION_TYPE_ENUM_END: FIRMWARE_VERSION_TYPE = 256;
pub type FIRMWARE_VERSION_TYPE = ::std::os::raw::c_uint;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_CUSTOM_MODE_ENABLED: MAV_MODE_FLAG = 1;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_TEST_ENABLED: MAV_MODE_FLAG = 2;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_AUTO_ENABLED: MAV_MODE_FLAG = 4;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_GUIDED_ENABLED: MAV_MODE_FLAG = 8;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_STABILIZE_ENABLED: MAV_MODE_FLAG = 16;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_HIL_ENABLED: MAV_MODE_FLAG = 32;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_MANUAL_INPUT_ENABLED: MAV_MODE_FLAG = 64;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_SAFETY_ARMED: MAV_MODE_FLAG = 128;
pub const MAV_MODE_FLAG_MAV_MODE_FLAG_ENUM_END: MAV_MODE_FLAG = 129;
pub type MAV_MODE_FLAG = ::std::os::raw::c_uint;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_CUSTOM_MODE: MAV_MODE_FLAG_DECODE_POSITION = 1;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_TEST: MAV_MODE_FLAG_DECODE_POSITION = 2;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_AUTO: MAV_MODE_FLAG_DECODE_POSITION = 4;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_GUIDED: MAV_MODE_FLAG_DECODE_POSITION = 8;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_STABILIZE: MAV_MODE_FLAG_DECODE_POSITION = 16;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_HIL: MAV_MODE_FLAG_DECODE_POSITION = 32;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_MANUAL: MAV_MODE_FLAG_DECODE_POSITION = 64;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_SAFETY: MAV_MODE_FLAG_DECODE_POSITION = 128;
pub const MAV_MODE_FLAG_DECODE_POSITION_MAV_MODE_FLAG_DECODE_POSITION_ENUM_END: MAV_MODE_FLAG_DECODE_POSITION = 129;
pub type MAV_MODE_FLAG_DECODE_POSITION = ::std::os::raw::c_uint;
pub const MAV_GOTO_MAV_GOTO_DO_HOLD: MAV_GOTO = 0;
pub const MAV_GOTO_MAV_GOTO_DO_CONTINUE: MAV_GOTO = 1;
pub const MAV_GOTO_MAV_GOTO_HOLD_AT_CURRENT_POSITION: MAV_GOTO = 2;
pub const MAV_GOTO_MAV_GOTO_HOLD_AT_SPECIFIED_POSITION: MAV_GOTO = 3;
pub const MAV_GOTO_MAV_GOTO_ENUM_END: MAV_GOTO = 4;
pub type MAV_GOTO = ::std::os::raw::c_uint;
pub const MAV_MODE_MAV_MODE_PREFLIGHT: MAV_MODE = 0;
pub const MAV_MODE_MAV_MODE_MANUAL_DISARMED: MAV_MODE = 64;
pub const MAV_MODE_MAV_MODE_TEST_DISARMED: MAV_MODE = 66;
pub const MAV_MODE_MAV_MODE_STABILIZE_DISARMED: MAV_MODE = 80;
pub const MAV_MODE_MAV_MODE_GUIDED_DISARMED: MAV_MODE = 88;
pub const MAV_MODE_MAV_MODE_AUTO_DISARMED: MAV_MODE = 92;
pub const MAV_MODE_MAV_MODE_MANUAL_ARMED: MAV_MODE = 192;
pub const MAV_MODE_MAV_MODE_TEST_ARMED: MAV_MODE = 194;
pub const MAV_MODE_MAV_MODE_STABILIZE_ARMED: MAV_MODE = 208;
pub const MAV_MODE_MAV_MODE_GUIDED_ARMED: MAV_MODE = 216;
pub const MAV_MODE_MAV_MODE_AUTO_ARMED: MAV_MODE = 220;
pub const MAV_MODE_MAV_MODE_ENUM_END: MAV_MODE = 221;
pub type MAV_MODE = ::std::os::raw::c_uint;
pub const MAV_STATE_MAV_STATE_UNINIT: MAV_STATE = 0;
pub const MAV_STATE_MAV_STATE_BOOT: MAV_STATE = 1;
pub const MAV_STATE_MAV_STATE_CALIBRATING: MAV_STATE = 2;
pub const MAV_STATE_MAV_STATE_STANDBY: MAV_STATE = 3;
pub const MAV_STATE_MAV_STATE_ACTIVE: MAV_STATE = 4;
pub const MAV_STATE_MAV_STATE_CRITICAL: MAV_STATE = 5;
pub const MAV_STATE_MAV_STATE_EMERGENCY: MAV_STATE = 6;
pub const MAV_STATE_MAV_STATE_POWEROFF: MAV_STATE = 7;
pub const MAV_STATE_MAV_STATE_FLIGHT_TERMINATION: MAV_STATE = 8;
pub const MAV_STATE_MAV_STATE_ENUM_END: MAV_STATE = 9;
pub type MAV_STATE = ::std::os::raw::c_uint;
pub const MAV_COMPONENT_MAV_COMP_ID_ALL: MAV_COMPONENT = 0;
pub const MAV_COMPONENT_MAV_COMP_ID_AUTOPILOT1: MAV_COMPONENT = 1;
pub const MAV_COMPONENT_MAV_COMP_ID_CAMERA: MAV_COMPONENT = 100;
pub const MAV_COMPONENT_MAV_COMP_ID_CAMERA2: MAV_COMPONENT = 101;
pub const MAV_COMPONENT_MAV_COMP_ID_CAMERA3: MAV_COMPONENT = 102;
pub const MAV_COMPONENT_MAV_COMP_ID_CAMERA4: MAV_COMPONENT = 103;
pub const MAV_COMPONENT_MAV_COMP_ID_CAMERA5: MAV_COMPONENT = 104;
pub const MAV_COMPONENT_MAV_COMP_ID_CAMERA6: MAV_COMPONENT = 105;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO1: MAV_COMPONENT = 140;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO2: MAV_COMPONENT = 141;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO3: MAV_COMPONENT = 142;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO4: MAV_COMPONENT = 143;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO5: MAV_COMPONENT = 144;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO6: MAV_COMPONENT = 145;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO7: MAV_COMPONENT = 146;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO8: MAV_COMPONENT = 147;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO9: MAV_COMPONENT = 148;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO10: MAV_COMPONENT = 149;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO11: MAV_COMPONENT = 150;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO12: MAV_COMPONENT = 151;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO13: MAV_COMPONENT = 152;
pub const MAV_COMPONENT_MAV_COMP_ID_SERVO14: MAV_COMPONENT = 153;
pub const MAV_COMPONENT_MAV_COMP_ID_GIMBAL: MAV_COMPONENT = 154;
pub const MAV_COMPONENT_MAV_COMP_ID_LOG: MAV_COMPONENT = 155;
pub const MAV_COMPONENT_MAV_COMP_ID_ADSB: MAV_COMPONENT = 156;
pub const MAV_COMPONENT_MAV_COMP_ID_OSD: MAV_COMPONENT = 157;
pub const MAV_COMPONENT_MAV_COMP_ID_PERIPHERAL: MAV_COMPONENT = 158;
pub const MAV_COMPONENT_MAV_COMP_ID_QX1_GIMBAL: MAV_COMPONENT = 159;
pub const MAV_COMPONENT_MAV_COMP_ID_MAPPER: MAV_COMPONENT = 180;
pub const MAV_COMPONENT_MAV_COMP_ID_MISSIONPLANNER: MAV_COMPONENT = 190;
pub const MAV_COMPONENT_MAV_COMP_ID_PATHPLANNER: MAV_COMPONENT = 195;
pub const MAV_COMPONENT_MAV_COMP_ID_IMU: MAV_COMPONENT = 200;
pub const MAV_COMPONENT_MAV_COMP_ID_IMU_2: MAV_COMPONENT = 201;
pub const MAV_COMPONENT_MAV_COMP_ID_IMU_3: MAV_COMPONENT = 202;
pub const MAV_COMPONENT_MAV_COMP_ID_GPS: MAV_COMPONENT = 220;
pub const MAV_COMPONENT_MAV_COMP_ID_GPS2: MAV_COMPONENT = 221;
pub const MAV_COMPONENT_MAV_COMP_ID_UDP_BRIDGE: MAV_COMPONENT = 240;
pub const MAV_COMPONENT_MAV_COMP_ID_UART_BRIDGE: MAV_COMPONENT = 241;
pub const MAV_COMPONENT_MAV_COMP_ID_SYSTEM_CONTROL: MAV_COMPONENT = 250;
pub const MAV_COMPONENT_MAV_COMPONENT_ENUM_END: MAV_COMPONENT = 251;
pub type MAV_COMPONENT = ::std::os::raw::c_uint;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_3D_GYRO: MAV_SYS_STATUS_SENSOR = 1;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_3D_ACCEL: MAV_SYS_STATUS_SENSOR = 2;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_3D_MAG: MAV_SYS_STATUS_SENSOR = 4;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_ABSOLUTE_PRESSURE: MAV_SYS_STATUS_SENSOR = 8;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_DIFFERENTIAL_PRESSURE: MAV_SYS_STATUS_SENSOR = 16;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_GPS: MAV_SYS_STATUS_SENSOR = 32;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_OPTICAL_FLOW: MAV_SYS_STATUS_SENSOR = 64;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_VISION_POSITION: MAV_SYS_STATUS_SENSOR = 128;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_LASER_POSITION: MAV_SYS_STATUS_SENSOR = 256;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_EXTERNAL_GROUND_TRUTH: MAV_SYS_STATUS_SENSOR = 512;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_ANGULAR_RATE_CONTROL: MAV_SYS_STATUS_SENSOR = 1024;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_ATTITUDE_STABILIZATION: MAV_SYS_STATUS_SENSOR = 2048;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_YAW_POSITION: MAV_SYS_STATUS_SENSOR = 4096;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_Z_ALTITUDE_CONTROL: MAV_SYS_STATUS_SENSOR = 8192;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_XY_POSITION_CONTROL: MAV_SYS_STATUS_SENSOR = 16384;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_MOTOR_OUTPUTS: MAV_SYS_STATUS_SENSOR = 32768;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_RC_RECEIVER: MAV_SYS_STATUS_SENSOR = 65536;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_3D_GYRO2: MAV_SYS_STATUS_SENSOR = 131072;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_3D_ACCEL2: MAV_SYS_STATUS_SENSOR = 262144;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_3D_MAG2: MAV_SYS_STATUS_SENSOR = 524288;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_GEOFENCE: MAV_SYS_STATUS_SENSOR = 1048576;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_AHRS: MAV_SYS_STATUS_SENSOR = 2097152;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_TERRAIN: MAV_SYS_STATUS_SENSOR = 4194304;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_REVERSE_MOTOR: MAV_SYS_STATUS_SENSOR = 8388608;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_LOGGING: MAV_SYS_STATUS_SENSOR = 16777216;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_BATTERY: MAV_SYS_STATUS_SENSOR = 33554432;
pub const MAV_SYS_STATUS_SENSOR_MAV_SYS_STATUS_SENSOR_ENUM_END: MAV_SYS_STATUS_SENSOR = 33554433;
pub type MAV_SYS_STATUS_SENSOR = ::std::os::raw::c_uint;
pub const MAV_FRAME_MAV_FRAME_GLOBAL: MAV_FRAME = 0;
pub const MAV_FRAME_MAV_FRAME_LOCAL_NED: MAV_FRAME = 1;
pub const MAV_FRAME_MAV_FRAME_MISSION: MAV_FRAME = 2;
pub const MAV_FRAME_MAV_FRAME_GLOBAL_RELATIVE_ALT: MAV_FRAME = 3;
pub const MAV_FRAME_MAV_FRAME_LOCAL_ENU: MAV_FRAME = 4;
pub const MAV_FRAME_MAV_FRAME_GLOBAL_INT: MAV_FRAME = 5;
pub const MAV_FRAME_MAV_FRAME_GLOBAL_RELATIVE_ALT_INT: MAV_FRAME = 6;
pub const MAV_FRAME_MAV_FRAME_LOCAL_OFFSET_NED: MAV_FRAME = 7;
pub const MAV_FRAME_MAV_FRAME_BODY_NED: MAV_FRAME = 8;
pub const MAV_FRAME_MAV_FRAME_BODY_OFFSET_NED: MAV_FRAME = 9;
pub const MAV_FRAME_MAV_FRAME_GLOBAL_TERRAIN_ALT: MAV_FRAME = 10;
pub const MAV_FRAME_MAV_FRAME_GLOBAL_TERRAIN_ALT_INT: MAV_FRAME = 11;
pub const MAV_FRAME_MAV_FRAME_ENUM_END: MAV_FRAME = 12;
pub type MAV_FRAME = ::std::os::raw::c_uint;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_IMG_JPEG: MAVLINK_DATA_STREAM_TYPE = 1;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_IMG_BMP: MAVLINK_DATA_STREAM_TYPE = 2;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_IMG_RAW8U: MAVLINK_DATA_STREAM_TYPE = 3;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_IMG_RAW32U: MAVLINK_DATA_STREAM_TYPE = 4;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_IMG_PGM: MAVLINK_DATA_STREAM_TYPE = 5;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_IMG_PNG: MAVLINK_DATA_STREAM_TYPE = 6;
pub const MAVLINK_DATA_STREAM_TYPE_MAVLINK_DATA_STREAM_TYPE_ENUM_END: MAVLINK_DATA_STREAM_TYPE = 7;
pub type MAVLINK_DATA_STREAM_TYPE = ::std::os::raw::c_uint;
pub const FENCE_ACTION_FENCE_ACTION_NONE: FENCE_ACTION = 0;
pub const FENCE_ACTION_FENCE_ACTION_GUIDED: FENCE_ACTION = 1;
pub const FENCE_ACTION_FENCE_ACTION_REPORT: FENCE_ACTION = 2;
pub const FENCE_ACTION_FENCE_ACTION_GUIDED_THR_PASS: FENCE_ACTION = 3;
pub const FENCE_ACTION_FENCE_ACTION_RTL: FENCE_ACTION = 4;
pub const FENCE_ACTION_FENCE_ACTION_ENUM_END: FENCE_ACTION = 5;
pub type FENCE_ACTION = ::std::os::raw::c_uint;
pub const FENCE_BREACH_FENCE_BREACH_NONE: FENCE_BREACH = 0;
pub const FENCE_BREACH_FENCE_BREACH_MINALT: FENCE_BREACH = 1;
pub const FENCE_BREACH_FENCE_BREACH_MAXALT: FENCE_BREACH = 2;
pub const FENCE_BREACH_FENCE_BREACH_BOUNDARY: FENCE_BREACH = 3;
pub const FENCE_BREACH_FENCE_BREACH_ENUM_END: FENCE_BREACH = 4;
pub type FENCE_BREACH = ::std::os::raw::c_uint;
pub const MAV_MOUNT_MODE_MAV_MOUNT_MODE_RETRACT: MAV_MOUNT_MODE = 0;
pub const MAV_MOUNT_MODE_MAV_MOUNT_MODE_NEUTRAL: MAV_MOUNT_MODE = 1;
pub const MAV_MOUNT_MODE_MAV_MOUNT_MODE_MAVLINK_TARGETING: MAV_MOUNT_MODE = 2;
pub const MAV_MOUNT_MODE_MAV_MOUNT_MODE_RC_TARGETING: MAV_MOUNT_MODE = 3;
pub const MAV_MOUNT_MODE_MAV_MOUNT_MODE_GPS_POINT: MAV_MOUNT_MODE = 4;
pub const MAV_MOUNT_MODE_MAV_MOUNT_MODE_ENUM_END: MAV_MOUNT_MODE = 5;
pub type MAV_MOUNT_MODE = ::std::os::raw::c_uint;
pub const UAVCAN_NODE_HEALTH_UAVCAN_NODE_HEALTH_OK: UAVCAN_NODE_HEALTH = 0;
pub const UAVCAN_NODE_HEALTH_UAVCAN_NODE_HEALTH_WARNING: UAVCAN_NODE_HEALTH = 1;
pub const UAVCAN_NODE_HEALTH_UAVCAN_NODE_HEALTH_ERROR: UAVCAN_NODE_HEALTH = 2;
pub const UAVCAN_NODE_HEALTH_UAVCAN_NODE_HEALTH_CRITICAL: UAVCAN_NODE_HEALTH = 3;
pub const UAVCAN_NODE_HEALTH_UAVCAN_NODE_HEALTH_ENUM_END: UAVCAN_NODE_HEALTH = 4;
pub type UAVCAN_NODE_HEALTH = ::std::os::raw::c_uint;
pub const UAVCAN_NODE_MODE_UAVCAN_NODE_MODE_OPERATIONAL: UAVCAN_NODE_MODE = 0;
pub const UAVCAN_NODE_MODE_UAVCAN_NODE_MODE_INITIALIZATION: UAVCAN_NODE_MODE = 1;
pub const UAVCAN_NODE_MODE_UAVCAN_NODE_MODE_MAINTENANCE: UAVCAN_NODE_MODE = 2;
pub const UAVCAN_NODE_MODE_UAVCAN_NODE_MODE_SOFTWARE_UPDATE: UAVCAN_NODE_MODE = 3;
pub const UAVCAN_NODE_MODE_UAVCAN_NODE_MODE_OFFLINE: UAVCAN_NODE_MODE = 7;
pub const UAVCAN_NODE_MODE_UAVCAN_NODE_MODE_ENUM_END: UAVCAN_NODE_MODE = 8;
pub type UAVCAN_NODE_MODE = ::std::os::raw::c_uint;
pub const MAV_CMD_MAV_CMD_NAV_WAYPOINT: MAV_CMD = 16;
pub const MAV_CMD_MAV_CMD_NAV_LOITER_UNLIM: MAV_CMD = 17;
pub const MAV_CMD_MAV_CMD_NAV_LOITER_TURNS: MAV_CMD = 18;
pub const MAV_CMD_MAV_CMD_NAV_LOITER_TIME: MAV_CMD = 19;
pub const MAV_CMD_MAV_CMD_NAV_RETURN_TO_LAUNCH: MAV_CMD = 20;
pub const MAV_CMD_MAV_CMD_NAV_LAND: MAV_CMD = 21;
pub const MAV_CMD_MAV_CMD_NAV_TAKEOFF: MAV_CMD = 22;
pub const MAV_CMD_MAV_CMD_NAV_LAND_LOCAL: MAV_CMD = 23;
pub const MAV_CMD_MAV_CMD_NAV_TAKEOFF_LOCAL: MAV_CMD = 24;
pub const MAV_CMD_MAV_CMD_NAV_FOLLOW: MAV_CMD = 25;
pub const MAV_CMD_MAV_CMD_NAV_CONTINUE_AND_CHANGE_ALT: MAV_CMD = 30;
pub const MAV_CMD_MAV_CMD_NAV_LOITER_TO_ALT: MAV_CMD = 31;
pub const MAV_CMD_MAV_CMD_DO_FOLLOW: MAV_CMD = 32;
pub const MAV_CMD_MAV_CMD_DO_FOLLOW_REPOSITION: MAV_CMD = 33;
pub const MAV_CMD_MAV_CMD_NAV_ROI: MAV_CMD = 80;
pub const MAV_CMD_MAV_CMD_NAV_PATHPLANNING: MAV_CMD = 81;
pub const MAV_CMD_MAV_CMD_NAV_SPLINE_WAYPOINT: MAV_CMD = 82;
pub const MAV_CMD_MAV_CMD_NAV_VTOL_TAKEOFF: MAV_CMD = 84;
pub const MAV_CMD_MAV_CMD_NAV_VTOL_LAND: MAV_CMD = 85;
pub const MAV_CMD_MAV_CMD_NAV_GUIDED_ENABLE: MAV_CMD = 92;
pub const MAV_CMD_MAV_CMD_NAV_DELAY: MAV_CMD = 93;
pub const MAV_CMD_MAV_CMD_NAV_PAYLOAD_PLACE: MAV_CMD = 94;
pub const MAV_CMD_MAV_CMD_NAV_LAST: MAV_CMD = 95;
pub const MAV_CMD_MAV_CMD_CONDITION_DELAY: MAV_CMD = 112;
pub const MAV_CMD_MAV_CMD_CONDITION_CHANGE_ALT: MAV_CMD = 113;
pub const MAV_CMD_MAV_CMD_CONDITION_DISTANCE: MAV_CMD = 114;
pub const MAV_CMD_MAV_CMD_CONDITION_YAW: MAV_CMD = 115;
pub const MAV_CMD_MAV_CMD_CONDITION_LAST: MAV_CMD = 159;
pub const MAV_CMD_MAV_CMD_DO_SET_MODE: MAV_CMD = 176;
pub const MAV_CMD_MAV_CMD_DO_JUMP: MAV_CMD = 177;
pub const MAV_CMD_MAV_CMD_DO_CHANGE_SPEED: MAV_CMD = 178;
pub const MAV_CMD_MAV_CMD_DO_SET_HOME: MAV_CMD = 179;
pub const MAV_CMD_MAV_CMD_DO_SET_PARAMETER: MAV_CMD = 180;
pub const MAV_CMD_MAV_CMD_DO_SET_RELAY: MAV_CMD = 181;
pub const MAV_CMD_MAV_CMD_DO_REPEAT_RELAY: MAV_CMD = 182;
pub const MAV_CMD_MAV_CMD_DO_SET_SERVO: MAV_CMD = 183;
pub const MAV_CMD_MAV_CMD_DO_REPEAT_SERVO: MAV_CMD = 184;
pub const MAV_CMD_MAV_CMD_DO_FLIGHTTERMINATION: MAV_CMD = 185;
pub const MAV_CMD_MAV_CMD_DO_CHANGE_ALTITUDE: MAV_CMD = 186;
pub const MAV_CMD_MAV_CMD_DO_LAND_START: MAV_CMD = 189;
pub const MAV_CMD_MAV_CMD_DO_RALLY_LAND: MAV_CMD = 190;
pub const MAV_CMD_MAV_CMD_DO_GO_AROUND: MAV_CMD = 191;
pub const MAV_CMD_MAV_CMD_DO_REPOSITION: MAV_CMD = 192;
pub const MAV_CMD_MAV_CMD_DO_PAUSE_CONTINUE: MAV_CMD = 193;
pub const MAV_CMD_MAV_CMD_DO_SET_REVERSE: MAV_CMD = 194;
pub const MAV_CMD_MAV_CMD_DO_SET_ROI_LOCATION: MAV_CMD = 195;
pub const MAV_CMD_MAV_CMD_DO_SET_ROI_WPNEXT_OFFSET: MAV_CMD = 196;
pub const MAV_CMD_MAV_CMD_DO_SET_ROI_NONE: MAV_CMD = 197;
pub const MAV_CMD_MAV_CMD_DO_CONTROL_VIDEO: MAV_CMD = 200;
pub const MAV_CMD_MAV_CMD_DO_SET_ROI: MAV_CMD = 201;
pub const MAV_CMD_MAV_CMD_DO_DIGICAM_CONFIGURE: MAV_CMD = 202;
pub const MAV_CMD_MAV_CMD_DO_DIGICAM_CONTROL: MAV_CMD = 203;
pub const MAV_CMD_MAV_CMD_DO_MOUNT_CONFIGURE: MAV_CMD = 204;
pub const MAV_CMD_MAV_CMD_DO_MOUNT_CONTROL: MAV_CMD = 205;
pub const MAV_CMD_MAV_CMD_DO_SET_CAM_TRIGG_DIST: MAV_CMD = 206;
pub const MAV_CMD_MAV_CMD_DO_FENCE_ENABLE: MAV_CMD = 207;
pub const MAV_CMD_MAV_CMD_DO_PARACHUTE: MAV_CMD = 208;
pub const MAV_CMD_MAV_CMD_DO_MOTOR_TEST: MAV_CMD = 209;
pub const MAV_CMD_MAV_CMD_DO_INVERTED_FLIGHT: MAV_CMD = 210;
pub const MAV_CMD_MAV_CMD_NAV_SET_YAW_SPEED: MAV_CMD = 213;
pub const MAV_CMD_MAV_CMD_DO_SET_CAM_TRIGG_INTERVAL: MAV_CMD = 214;
pub const MAV_CMD_MAV_CMD_DO_MOUNT_CONTROL_QUAT: MAV_CMD = 220;
pub const MAV_CMD_MAV_CMD_DO_GUIDED_MASTER: MAV_CMD = 221;
pub const MAV_CMD_MAV_CMD_DO_GUIDED_LIMITS: MAV_CMD = 222;
pub const MAV_CMD_MAV_CMD_DO_ENGINE_CONTROL: MAV_CMD = 223;
pub const MAV_CMD_MAV_CMD_DO_LAST: MAV_CMD = 240;
pub const MAV_CMD_MAV_CMD_PREFLIGHT_CALIBRATION: MAV_CMD = 241;
pub const MAV_CMD_MAV_CMD_PREFLIGHT_SET_SENSOR_OFFSETS: MAV_CMD = 242;
pub const MAV_CMD_MAV_CMD_PREFLIGHT_UAVCAN: MAV_CMD = 243;
pub const MAV_CMD_MAV_CMD_PREFLIGHT_STORAGE: MAV_CMD = 245;
pub const MAV_CMD_MAV_CMD_PREFLIGHT_REBOOT_SHUTDOWN: MAV_CMD = 246;
pub const MAV_CMD_MAV_CMD_OVERRIDE_GOTO: MAV_CMD = 252;
pub const MAV_CMD_MAV_CMD_MISSION_START: MAV_CMD = 300;
pub const MAV_CMD_MAV_CMD_COMPONENT_ARM_DISARM: MAV_CMD = 400;
pub const MAV_CMD_MAV_CMD_GET_HOME_POSITION: MAV_CMD = 410;
pub const MAV_CMD_MAV_CMD_START_RX_PAIR: MAV_CMD = 500;
pub const MAV_CMD_MAV_CMD_GET_MESSAGE_INTERVAL: MAV_CMD = 510;
pub const MAV_CMD_MAV_CMD_SET_MESSAGE_INTERVAL: MAV_CMD = 511;
pub const MAV_CMD_MAV_CMD_REQUEST_PROTOCOL_VERSION: MAV_CMD = 519;
pub const MAV_CMD_MAV_CMD_REQUEST_AUTOPILOT_CAPABILITIES: MAV_CMD = 520;
pub const MAV_CMD_MAV_CMD_REQUEST_CAMERA_INFORMATION: MAV_CMD = 521;
pub const MAV_CMD_MAV_CMD_REQUEST_CAMERA_SETTINGS: MAV_CMD = 522;
pub const MAV_CMD_MAV_CMD_REQUEST_STORAGE_INFORMATION: MAV_CMD = 525;
pub const MAV_CMD_MAV_CMD_STORAGE_FORMAT: MAV_CMD = 526;
pub const MAV_CMD_MAV_CMD_REQUEST_CAMERA_CAPTURE_STATUS: MAV_CMD = 527;
pub const MAV_CMD_MAV_CMD_REQUEST_FLIGHT_INFORMATION: MAV_CMD = 528;
pub const MAV_CMD_MAV_CMD_RESET_CAMERA_SETTINGS: MAV_CMD = 529;
pub const MAV_CMD_MAV_CMD_SET_CAMERA_MODE: MAV_CMD = 530;
pub const MAV_CMD_MAV_CMD_IMAGE_START_CAPTURE: MAV_CMD = 2000;
pub const MAV_CMD_MAV_CMD_IMAGE_STOP_CAPTURE: MAV_CMD = 2001;
pub const MAV_CMD_MAV_CMD_REQUEST_CAMERA_IMAGE_CAPTURE: MAV_CMD = 2002;
pub const MAV_CMD_MAV_CMD_DO_TRIGGER_CONTROL: MAV_CMD = 2003;
pub const MAV_CMD_MAV_CMD_VIDEO_START_CAPTURE: MAV_CMD = 2500;
pub const MAV_CMD_MAV_CMD_VIDEO_STOP_CAPTURE: MAV_CMD = 2501;
pub const MAV_CMD_MAV_CMD_VIDEO_START_STREAMING: MAV_CMD = 2502;
pub const MAV_CMD_MAV_CMD_VIDEO_STOP_STREAMING: MAV_CMD = 2503;
pub const MAV_CMD_MAV_CMD_REQUEST_VIDEO_STREAM_INFORMATION: MAV_CMD = 2504;
pub const MAV_CMD_MAV_CMD_LOGGING_START: MAV_CMD = 2510;
pub const MAV_CMD_MAV_CMD_LOGGING_STOP: MAV_CMD = 2511;
pub const MAV_CMD_MAV_CMD_AIRFRAME_CONFIGURATION: MAV_CMD = 2520;
pub const MAV_CMD_MAV_CMD_PANORAMA_CREATE: MAV_CMD = 2800;
pub const MAV_CMD_MAV_CMD_DO_VTOL_TRANSITION: MAV_CMD = 3000;
pub const MAV_CMD_MAV_CMD_ARM_AUTHORIZATION_REQUEST: MAV_CMD = 3001;
pub const MAV_CMD_MAV_CMD_SET_GUIDED_SUBMODE_STANDARD: MAV_CMD = 4000;
pub const MAV_CMD_MAV_CMD_SET_GUIDED_SUBMODE_CIRCLE: MAV_CMD = 4001;
pub const MAV_CMD_MAV_CMD_CONDITION_GATE: MAV_CMD = 4501;
pub const MAV_CMD_MAV_CMD_NAV_FENCE_RETURN_POINT: MAV_CMD = 5000;
pub const MAV_CMD_MAV_CMD_NAV_FENCE_POLYGON_VERTEX_INCLUSION: MAV_CMD = 5001;
pub const MAV_CMD_MAV_CMD_NAV_FENCE_POLYGON_VERTEX_EXCLUSION: MAV_CMD = 5002;
pub const MAV_CMD_MAV_CMD_NAV_FENCE_CIRCLE_INCLUSION: MAV_CMD = 5003;
pub const MAV_CMD_MAV_CMD_NAV_FENCE_CIRCLE_EXCLUSION: MAV_CMD = 5004;
pub const MAV_CMD_MAV_CMD_NAV_RALLY_POINT: MAV_CMD = 5100;
pub const MAV_CMD_MAV_CMD_UAVCAN_GET_NODE_INFO: MAV_CMD = 5200;
pub const MAV_CMD_MAV_CMD_PAYLOAD_PREPARE_DEPLOY: MAV_CMD = 30001;
pub const MAV_CMD_MAV_CMD_PAYLOAD_CONTROL_DEPLOY: MAV_CMD = 30002;
pub const MAV_CMD_MAV_CMD_WAYPOINT_USER_1: MAV_CMD = 31000;
pub const MAV_CMD_MAV_CMD_WAYPOINT_USER_2: MAV_CMD = 31001;
pub const MAV_CMD_MAV_CMD_WAYPOINT_USER_3: MAV_CMD = 31002;
pub const MAV_CMD_MAV_CMD_WAYPOINT_USER_4: MAV_CMD = 31003;
pub const MAV_CMD_MAV_CMD_WAYPOINT_USER_5: MAV_CMD = 31004;
pub const MAV_CMD_MAV_CMD_SPATIAL_USER_1: MAV_CMD = 31005;
pub const MAV_CMD_MAV_CMD_SPATIAL_USER_2: MAV_CMD = 31006;
pub const MAV_CMD_MAV_CMD_SPATIAL_USER_3: MAV_CMD = 31007;
pub const MAV_CMD_MAV_CMD_SPATIAL_USER_4: MAV_CMD = 31008;
pub const MAV_CMD_MAV_CMD_SPATIAL_USER_5: MAV_CMD = 31009;
pub const MAV_CMD_MAV_CMD_USER_1: MAV_CMD = 31010;
pub const MAV_CMD_MAV_CMD_USER_2: MAV_CMD = 31011;
pub const MAV_CMD_MAV_CMD_USER_3: MAV_CMD = 31012;
pub const MAV_CMD_MAV_CMD_USER_4: MAV_CMD = 31013;
pub const MAV_CMD_MAV_CMD_USER_5: MAV_CMD = 31014;
pub const MAV_CMD_MAV_CMD_ENUM_END: MAV_CMD = 31015;
pub type MAV_CMD = ::std::os::raw::c_uint;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_ALL: MAV_DATA_STREAM = 0;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_RAW_SENSORS: MAV_DATA_STREAM = 1;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_EXTENDED_STATUS: MAV_DATA_STREAM = 2;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_RC_CHANNELS: MAV_DATA_STREAM = 3;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_RAW_CONTROLLER: MAV_DATA_STREAM = 4;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_POSITION: MAV_DATA_STREAM = 6;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_EXTRA1: MAV_DATA_STREAM = 10;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_EXTRA2: MAV_DATA_STREAM = 11;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_EXTRA3: MAV_DATA_STREAM = 12;
pub const MAV_DATA_STREAM_MAV_DATA_STREAM_ENUM_END: MAV_DATA_STREAM = 13;
pub type MAV_DATA_STREAM = ::std::os::raw::c_uint;
pub const MAV_ROI_MAV_ROI_NONE: MAV_ROI = 0;
pub const MAV_ROI_MAV_ROI_WPNEXT: MAV_ROI = 1;
pub const MAV_ROI_MAV_ROI_WPINDEX: MAV_ROI = 2;
pub const MAV_ROI_MAV_ROI_LOCATION: MAV_ROI = 3;
pub const MAV_ROI_MAV_ROI_TARGET: MAV_ROI = 4;
pub const MAV_ROI_MAV_ROI_ENUM_END: MAV_ROI = 5;
pub type MAV_ROI = ::std::os::raw::c_uint;
pub const MAV_CMD_ACK_MAV_CMD_ACK_OK: MAV_CMD_ACK = 1;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_FAIL: MAV_CMD_ACK = 2;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_ACCESS_DENIED: MAV_CMD_ACK = 3;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_NOT_SUPPORTED: MAV_CMD_ACK = 4;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_COORDINATE_FRAME_NOT_SUPPORTED: MAV_CMD_ACK = 5;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_COORDINATES_OUT_OF_RANGE: MAV_CMD_ACK = 6;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_X_LAT_OUT_OF_RANGE: MAV_CMD_ACK = 7;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_Y_LON_OUT_OF_RANGE: MAV_CMD_ACK = 8;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ERR_Z_ALT_OUT_OF_RANGE: MAV_CMD_ACK = 9;
pub const MAV_CMD_ACK_MAV_CMD_ACK_ENUM_END: MAV_CMD_ACK = 10;
pub type MAV_CMD_ACK = ::std::os::raw::c_uint;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_UINT8: MAV_PARAM_TYPE = 1;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_INT8: MAV_PARAM_TYPE = 2;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_UINT16: MAV_PARAM_TYPE = 3;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_INT16: MAV_PARAM_TYPE = 4;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_UINT32: MAV_PARAM_TYPE = 5;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_INT32: MAV_PARAM_TYPE = 6;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_UINT64: MAV_PARAM_TYPE = 7;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_INT64: MAV_PARAM_TYPE = 8;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_REAL32: MAV_PARAM_TYPE = 9;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_REAL64: MAV_PARAM_TYPE = 10;
pub const MAV_PARAM_TYPE_MAV_PARAM_TYPE_ENUM_END: MAV_PARAM_TYPE = 11;
pub type MAV_PARAM_TYPE = ::std::os::raw::c_uint;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_UINT8: MAV_PARAM_EXT_TYPE = 1;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_INT8: MAV_PARAM_EXT_TYPE = 2;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_UINT16: MAV_PARAM_EXT_TYPE = 3;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_INT16: MAV_PARAM_EXT_TYPE = 4;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_UINT32: MAV_PARAM_EXT_TYPE = 5;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_INT32: MAV_PARAM_EXT_TYPE = 6;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_UINT64: MAV_PARAM_EXT_TYPE = 7;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_INT64: MAV_PARAM_EXT_TYPE = 8;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_REAL32: MAV_PARAM_EXT_TYPE = 9;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_REAL64: MAV_PARAM_EXT_TYPE = 10;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_CUSTOM: MAV_PARAM_EXT_TYPE = 11;
pub const MAV_PARAM_EXT_TYPE_MAV_PARAM_EXT_TYPE_ENUM_END: MAV_PARAM_EXT_TYPE = 12;
pub type MAV_PARAM_EXT_TYPE = ::std::os::raw::c_uint;
pub const MAV_RESULT_MAV_RESULT_ACCEPTED: MAV_RESULT = 0;
pub const MAV_RESULT_MAV_RESULT_TEMPORARILY_REJECTED: MAV_RESULT = 1;
pub const MAV_RESULT_MAV_RESULT_DENIED: MAV_RESULT = 2;
pub const MAV_RESULT_MAV_RESULT_UNSUPPORTED: MAV_RESULT = 3;
pub const MAV_RESULT_MAV_RESULT_FAILED: MAV_RESULT = 4;
pub const MAV_RESULT_MAV_RESULT_IN_PROGRESS: MAV_RESULT = 5;
pub const MAV_RESULT_MAV_RESULT_ENUM_END: MAV_RESULT = 6;
pub type MAV_RESULT = ::std::os::raw::c_uint;
pub const MAV_MISSION_RESULT_MAV_MISSION_ACCEPTED: MAV_MISSION_RESULT = 0;
pub const MAV_MISSION_RESULT_MAV_MISSION_ERROR: MAV_MISSION_RESULT = 1;
pub const MAV_MISSION_RESULT_MAV_MISSION_UNSUPPORTED_FRAME: MAV_MISSION_RESULT = 2;
pub const MAV_MISSION_RESULT_MAV_MISSION_UNSUPPORTED: MAV_MISSION_RESULT = 3;
pub const MAV_MISSION_RESULT_MAV_MISSION_NO_SPACE: MAV_MISSION_RESULT = 4;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID: MAV_MISSION_RESULT = 5;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM1: MAV_MISSION_RESULT = 6;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM2: MAV_MISSION_RESULT = 7;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM3: MAV_MISSION_RESULT = 8;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM4: MAV_MISSION_RESULT = 9;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM5_X: MAV_MISSION_RESULT = 10;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM6_Y: MAV_MISSION_RESULT = 11;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_PARAM7: MAV_MISSION_RESULT = 12;
pub const MAV_MISSION_RESULT_MAV_MISSION_INVALID_SEQUENCE: MAV_MISSION_RESULT = 13;
pub const MAV_MISSION_RESULT_MAV_MISSION_DENIED: MAV_MISSION_RESULT = 14;
pub const MAV_MISSION_RESULT_MAV_MISSION_RESULT_ENUM_END: MAV_MISSION_RESULT = 15;
pub type MAV_MISSION_RESULT = ::std::os::raw::c_uint;
pub const MAV_SEVERITY_MAV_SEVERITY_EMERGENCY: MAV_SEVERITY = 0;
pub const MAV_SEVERITY_MAV_SEVERITY_ALERT: MAV_SEVERITY = 1;
pub const MAV_SEVERITY_MAV_SEVERITY_CRITICAL: MAV_SEVERITY = 2;
pub const MAV_SEVERITY_MAV_SEVERITY_ERROR: MAV_SEVERITY = 3;
pub const MAV_SEVERITY_MAV_SEVERITY_WARNING: MAV_SEVERITY = 4;
pub const MAV_SEVERITY_MAV_SEVERITY_NOTICE: MAV_SEVERITY = 5;
pub const MAV_SEVERITY_MAV_SEVERITY_INFO: MAV_SEVERITY = 6;
pub const MAV_SEVERITY_MAV_SEVERITY_DEBUG: MAV_SEVERITY = 7;
pub const MAV_SEVERITY_MAV_SEVERITY_ENUM_END: MAV_SEVERITY = 8;
pub type MAV_SEVERITY = ::std::os::raw::c_uint;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_BRICK_VALID: MAV_POWER_STATUS = 1;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_SERVO_VALID: MAV_POWER_STATUS = 2;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_USB_CONNECTED: MAV_POWER_STATUS = 4;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_PERIPH_OVERCURRENT: MAV_POWER_STATUS = 8;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_PERIPH_HIPOWER_OVERCURRENT: MAV_POWER_STATUS = 16;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_CHANGED: MAV_POWER_STATUS = 32;
pub const MAV_POWER_STATUS_MAV_POWER_STATUS_ENUM_END: MAV_POWER_STATUS = 33;
pub type MAV_POWER_STATUS = ::std::os::raw::c_uint;
pub const SERIAL_CONTROL_DEV_SERIAL_CONTROL_DEV_TELEM1: SERIAL_CONTROL_DEV = 0;
pub const SERIAL_CONTROL_DEV_SERIAL_CONTROL_DEV_TELEM2: SERIAL_CONTROL_DEV = 1;
pub const SERIAL_CONTROL_DEV_SERIAL_CONTROL_DEV_GPS1: SERIAL_CONTROL_DEV = 2;
pub const SERIAL_CONTROL_DEV_SERIAL_CONTROL_DEV_GPS2: SERIAL_CONTROL_DEV = 3;
pub const SERIAL_CONTROL_DEV_SERIAL_CONTROL_DEV_SHELL: SERIAL_CONTROL_DEV = 10;
pub const SERIAL_CONTROL_DEV_SERIAL_CONTROL_DEV_ENUM_END: SERIAL_CONTROL_DEV = 11;
pub type SERIAL_CONTROL_DEV = ::std::os::raw::c_uint;
pub const SERIAL_CONTROL_FLAG_SERIAL_CONTROL_FLAG_REPLY: SERIAL_CONTROL_FLAG = 1;
pub const SERIAL_CONTROL_FLAG_SERIAL_CONTROL_FLAG_RESPOND: SERIAL_CONTROL_FLAG = 2;
pub const SERIAL_CONTROL_FLAG_SERIAL_CONTROL_FLAG_EXCLUSIVE: SERIAL_CONTROL_FLAG = 4;
pub const SERIAL_CONTROL_FLAG_SERIAL_CONTROL_FLAG_BLOCKING: SERIAL_CONTROL_FLAG = 8;
pub const SERIAL_CONTROL_FLAG_SERIAL_CONTROL_FLAG_MULTI: SERIAL_CONTROL_FLAG = 16;
pub const SERIAL_CONTROL_FLAG_SERIAL_CONTROL_FLAG_ENUM_END: SERIAL_CONTROL_FLAG = 17;
pub type SERIAL_CONTROL_FLAG = ::std::os::raw::c_uint;
pub const MAV_DISTANCE_SENSOR_MAV_DISTANCE_SENSOR_LASER: MAV_DISTANCE_SENSOR = 0;
pub const MAV_DISTANCE_SENSOR_MAV_DISTANCE_SENSOR_ULTRASOUND: MAV_DISTANCE_SENSOR = 1;
pub const MAV_DISTANCE_SENSOR_MAV_DISTANCE_SENSOR_INFRARED: MAV_DISTANCE_SENSOR = 2;
pub const MAV_DISTANCE_SENSOR_MAV_DISTANCE_SENSOR_RADAR: MAV_DISTANCE_SENSOR = 3;
pub const MAV_DISTANCE_SENSOR_MAV_DISTANCE_SENSOR_UNKNOWN: MAV_DISTANCE_SENSOR = 4;
pub const MAV_DISTANCE_SENSOR_MAV_DISTANCE_SENSOR_ENUM_END: MAV_DISTANCE_SENSOR = 5;
pub type MAV_DISTANCE_SENSOR = ::std::os::raw::c_uint;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_NONE: MAV_SENSOR_ORIENTATION = 0;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_45: MAV_SENSOR_ORIENTATION = 1;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_90: MAV_SENSOR_ORIENTATION = 2;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_135: MAV_SENSOR_ORIENTATION = 3;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_180: MAV_SENSOR_ORIENTATION = 4;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_225: MAV_SENSOR_ORIENTATION = 5;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_270: MAV_SENSOR_ORIENTATION = 6;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_YAW_315: MAV_SENSOR_ORIENTATION = 7;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180: MAV_SENSOR_ORIENTATION = 8;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_YAW_45: MAV_SENSOR_ORIENTATION = 9;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_YAW_90: MAV_SENSOR_ORIENTATION = 10;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_YAW_135: MAV_SENSOR_ORIENTATION = 11;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_PITCH_180: MAV_SENSOR_ORIENTATION = 12;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_YAW_225: MAV_SENSOR_ORIENTATION = 13;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_YAW_270: MAV_SENSOR_ORIENTATION = 14;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_YAW_315: MAV_SENSOR_ORIENTATION = 15;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90: MAV_SENSOR_ORIENTATION = 16;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_YAW_45: MAV_SENSOR_ORIENTATION = 17;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_YAW_90: MAV_SENSOR_ORIENTATION = 18;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_YAW_135: MAV_SENSOR_ORIENTATION = 19;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270: MAV_SENSOR_ORIENTATION = 20;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270_YAW_45: MAV_SENSOR_ORIENTATION = 21;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270_YAW_90: MAV_SENSOR_ORIENTATION = 22;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270_YAW_135: MAV_SENSOR_ORIENTATION = 23;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_PITCH_90: MAV_SENSOR_ORIENTATION = 24;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_PITCH_270: MAV_SENSOR_ORIENTATION = 25;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_PITCH_180_YAW_90: MAV_SENSOR_ORIENTATION = 26;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_PITCH_180_YAW_270: MAV_SENSOR_ORIENTATION = 27;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_PITCH_90: MAV_SENSOR_ORIENTATION = 28;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_PITCH_90: MAV_SENSOR_ORIENTATION = 29;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270_PITCH_90: MAV_SENSOR_ORIENTATION = 30;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_PITCH_180: MAV_SENSOR_ORIENTATION = 31;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270_PITCH_180: MAV_SENSOR_ORIENTATION = 32;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_PITCH_270: MAV_SENSOR_ORIENTATION = 33;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_180_PITCH_270: MAV_SENSOR_ORIENTATION = 34;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_270_PITCH_270: MAV_SENSOR_ORIENTATION = 35;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_PITCH_180_YAW_90: MAV_SENSOR_ORIENTATION = 36;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_90_YAW_270: MAV_SENSOR_ORIENTATION = 37;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ROTATION_ROLL_315_PITCH_315_YAW_315: MAV_SENSOR_ORIENTATION = 38;
pub const MAV_SENSOR_ORIENTATION_MAV_SENSOR_ORIENTATION_ENUM_END: MAV_SENSOR_ORIENTATION = 39;
pub type MAV_SENSOR_ORIENTATION = ::std::os::raw::c_uint;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_MISSION_FLOAT: MAV_PROTOCOL_CAPABILITY = 1;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_PARAM_FLOAT: MAV_PROTOCOL_CAPABILITY = 2;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_MISSION_INT: MAV_PROTOCOL_CAPABILITY = 4;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_COMMAND_INT: MAV_PROTOCOL_CAPABILITY = 8;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_PARAM_UNION: MAV_PROTOCOL_CAPABILITY = 16;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_FTP: MAV_PROTOCOL_CAPABILITY = 32;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_SET_ATTITUDE_TARGET: MAV_PROTOCOL_CAPABILITY = 64;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_SET_POSITION_TARGET_LOCAL_NED: MAV_PROTOCOL_CAPABILITY = 128;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_SET_POSITION_TARGET_GLOBAL_INT: MAV_PROTOCOL_CAPABILITY = 256;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_TERRAIN: MAV_PROTOCOL_CAPABILITY = 512;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_SET_ACTUATOR_TARGET: MAV_PROTOCOL_CAPABILITY = 1024;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_FLIGHT_TERMINATION: MAV_PROTOCOL_CAPABILITY = 2048;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_COMPASS_CALIBRATION: MAV_PROTOCOL_CAPABILITY = 4096;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_MAVLINK2: MAV_PROTOCOL_CAPABILITY = 8192;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_MISSION_FENCE: MAV_PROTOCOL_CAPABILITY = 16384;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_MISSION_RALLY: MAV_PROTOCOL_CAPABILITY = 32768;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_FLIGHT_INFORMATION: MAV_PROTOCOL_CAPABILITY = 65536;
pub const MAV_PROTOCOL_CAPABILITY_MAV_PROTOCOL_CAPABILITY_ENUM_END: MAV_PROTOCOL_CAPABILITY = 65537;
pub type MAV_PROTOCOL_CAPABILITY = ::std::os::raw::c_uint;
pub const MAV_MISSION_TYPE_MAV_MISSION_TYPE_MISSION: MAV_MISSION_TYPE = 0;
pub const MAV_MISSION_TYPE_MAV_MISSION_TYPE_FENCE: MAV_MISSION_TYPE = 1;
pub const MAV_MISSION_TYPE_MAV_MISSION_TYPE_RALLY: MAV_MISSION_TYPE = 2;
pub const MAV_MISSION_TYPE_MAV_MISSION_TYPE_ALL: MAV_MISSION_TYPE = 255;
pub const MAV_MISSION_TYPE_MAV_MISSION_TYPE_ENUM_END: MAV_MISSION_TYPE = 256;
pub type MAV_MISSION_TYPE = ::std::os::raw::c_uint;
pub const MAV_ESTIMATOR_TYPE_MAV_ESTIMATOR_TYPE_NAIVE: MAV_ESTIMATOR_TYPE = 1;
pub const MAV_ESTIMATOR_TYPE_MAV_ESTIMATOR_TYPE_VISION: MAV_ESTIMATOR_TYPE = 2;
pub const MAV_ESTIMATOR_TYPE_MAV_ESTIMATOR_TYPE_VIO: MAV_ESTIMATOR_TYPE = 3;
pub const MAV_ESTIMATOR_TYPE_MAV_ESTIMATOR_TYPE_GPS: MAV_ESTIMATOR_TYPE = 4;
pub const MAV_ESTIMATOR_TYPE_MAV_ESTIMATOR_TYPE_GPS_INS: MAV_ESTIMATOR_TYPE = 5;
pub const MAV_ESTIMATOR_TYPE_MAV_ESTIMATOR_TYPE_ENUM_END: MAV_ESTIMATOR_TYPE = 6;
pub type MAV_ESTIMATOR_TYPE = ::std::os::raw::c_uint;
pub const MAV_BATTERY_TYPE_MAV_BATTERY_TYPE_UNKNOWN: MAV_BATTERY_TYPE = 0;
pub const MAV_BATTERY_TYPE_MAV_BATTERY_TYPE_LIPO: MAV_BATTERY_TYPE = 1;
pub const MAV_BATTERY_TYPE_MAV_BATTERY_TYPE_LIFE: MAV_BATTERY_TYPE = 2;
pub const MAV_BATTERY_TYPE_MAV_BATTERY_TYPE_LION: MAV_BATTERY_TYPE = 3;
pub const MAV_BATTERY_TYPE_MAV_BATTERY_TYPE_NIMH: MAV_BATTERY_TYPE = 4;
pub const MAV_BATTERY_TYPE_MAV_BATTERY_TYPE_ENUM_END: MAV_BATTERY_TYPE = 5;
pub type MAV_BATTERY_TYPE = ::std::os::raw::c_uint;
pub const MAV_BATTERY_FUNCTION_MAV_BATTERY_FUNCTION_UNKNOWN: MAV_BATTERY_FUNCTION = 0;
pub const MAV_BATTERY_FUNCTION_MAV_BATTERY_FUNCTION_ALL: MAV_BATTERY_FUNCTION = 1;
pub const MAV_BATTERY_FUNCTION_MAV_BATTERY_FUNCTION_PROPULSION: MAV_BATTERY_FUNCTION = 2;
pub const MAV_BATTERY_FUNCTION_MAV_BATTERY_FUNCTION_AVIONICS: MAV_BATTERY_FUNCTION = 3;
pub const MAV_BATTERY_FUNCTION_MAV_BATTERY_TYPE_PAYLOAD: MAV_BATTERY_FUNCTION = 4;
pub const MAV_BATTERY_FUNCTION_MAV_BATTERY_FUNCTION_ENUM_END: MAV_BATTERY_FUNCTION = 5;
pub type MAV_BATTERY_FUNCTION = ::std::os::raw::c_uint;
pub const MAV_VTOL_STATE_MAV_VTOL_STATE_UNDEFINED: MAV_VTOL_STATE = 0;
pub const MAV_VTOL_STATE_MAV_VTOL_STATE_TRANSITION_TO_FW: MAV_VTOL_STATE = 1;
pub const MAV_VTOL_STATE_MAV_VTOL_STATE_TRANSITION_TO_MC: MAV_VTOL_STATE = 2;
pub const MAV_VTOL_STATE_MAV_VTOL_STATE_MC: MAV_VTOL_STATE = 3;
pub const MAV_VTOL_STATE_MAV_VTOL_STATE_FW: MAV_VTOL_STATE = 4;
pub const MAV_VTOL_STATE_MAV_VTOL_STATE_ENUM_END: MAV_VTOL_STATE = 5;
pub type MAV_VTOL_STATE = ::std::os::raw::c_uint;
pub const MAV_LANDED_STATE_MAV_LANDED_STATE_UNDEFINED: MAV_LANDED_STATE = 0;
pub const MAV_LANDED_STATE_MAV_LANDED_STATE_ON_GROUND: MAV_LANDED_STATE = 1;
pub const MAV_LANDED_STATE_MAV_LANDED_STATE_IN_AIR: MAV_LANDED_STATE = 2;
pub const MAV_LANDED_STATE_MAV_LANDED_STATE_TAKEOFF: MAV_LANDED_STATE = 3;
pub const MAV_LANDED_STATE_MAV_LANDED_STATE_LANDING: MAV_LANDED_STATE = 4;
pub const MAV_LANDED_STATE_MAV_LANDED_STATE_ENUM_END: MAV_LANDED_STATE = 5;
pub type MAV_LANDED_STATE = ::std::os::raw::c_uint;
pub const ADSB_ALTITUDE_TYPE_ADSB_ALTITUDE_TYPE_PRESSURE_QNH: ADSB_ALTITUDE_TYPE = 0;
pub const ADSB_ALTITUDE_TYPE_ADSB_ALTITUDE_TYPE_GEOMETRIC: ADSB_ALTITUDE_TYPE = 1;
pub const ADSB_ALTITUDE_TYPE_ADSB_ALTITUDE_TYPE_ENUM_END: ADSB_ALTITUDE_TYPE = 2;
pub type ADSB_ALTITUDE_TYPE = ::std::os::raw::c_uint;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_NO_INFO: ADSB_EMITTER_TYPE = 0;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_LIGHT: ADSB_EMITTER_TYPE = 1;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_SMALL: ADSB_EMITTER_TYPE = 2;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_LARGE: ADSB_EMITTER_TYPE = 3;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_HIGH_VORTEX_LARGE: ADSB_EMITTER_TYPE = 4;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_HEAVY: ADSB_EMITTER_TYPE = 5;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_HIGHLY_MANUV: ADSB_EMITTER_TYPE = 6;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_ROTOCRAFT: ADSB_EMITTER_TYPE = 7;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_UNASSIGNED: ADSB_EMITTER_TYPE = 8;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_GLIDER: ADSB_EMITTER_TYPE = 9;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_LIGHTER_AIR: ADSB_EMITTER_TYPE = 10;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_PARACHUTE: ADSB_EMITTER_TYPE = 11;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_ULTRA_LIGHT: ADSB_EMITTER_TYPE = 12;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_UNASSIGNED2: ADSB_EMITTER_TYPE = 13;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_UAV: ADSB_EMITTER_TYPE = 14;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_SPACE: ADSB_EMITTER_TYPE = 15;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_UNASSGINED3: ADSB_EMITTER_TYPE = 16;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_EMERGENCY_SURFACE: ADSB_EMITTER_TYPE = 17;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_SERVICE_SURFACE: ADSB_EMITTER_TYPE = 18;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_POINT_OBSTACLE: ADSB_EMITTER_TYPE = 19;
pub const ADSB_EMITTER_TYPE_ADSB_EMITTER_TYPE_ENUM_END: ADSB_EMITTER_TYPE = 20;
pub type ADSB_EMITTER_TYPE = ::std::os::raw::c_uint;
pub const ADSB_FLAGS_ADSB_FLAGS_VALID_COORDS: ADSB_FLAGS = 1;
pub const ADSB_FLAGS_ADSB_FLAGS_VALID_ALTITUDE: ADSB_FLAGS = 2;
pub const ADSB_FLAGS_ADSB_FLAGS_VALID_HEADING: ADSB_FLAGS = 4;
pub const ADSB_FLAGS_ADSB_FLAGS_VALID_VELOCITY: ADSB_FLAGS = 8;
pub const ADSB_FLAGS_ADSB_FLAGS_VALID_CALLSIGN: ADSB_FLAGS = 16;
pub const ADSB_FLAGS_ADSB_FLAGS_VALID_SQUAWK: ADSB_FLAGS = 32;
pub const ADSB_FLAGS_ADSB_FLAGS_SIMULATED: ADSB_FLAGS = 64;
pub const ADSB_FLAGS_ADSB_FLAGS_ENUM_END: ADSB_FLAGS = 65;
pub type ADSB_FLAGS = ::std::os::raw::c_uint;
pub const MAV_DO_REPOSITION_FLAGS_MAV_DO_REPOSITION_FLAGS_CHANGE_MODE: MAV_DO_REPOSITION_FLAGS = 1;
pub const MAV_DO_REPOSITION_FLAGS_MAV_DO_REPOSITION_FLAGS_ENUM_END: MAV_DO_REPOSITION_FLAGS = 2;
pub type MAV_DO_REPOSITION_FLAGS = ::std::os::raw::c_uint;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_ATTITUDE: ESTIMATOR_STATUS_FLAGS = 1;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_VELOCITY_HORIZ: ESTIMATOR_STATUS_FLAGS = 2;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_VELOCITY_VERT: ESTIMATOR_STATUS_FLAGS = 4;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_POS_HORIZ_REL: ESTIMATOR_STATUS_FLAGS = 8;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_POS_HORIZ_ABS: ESTIMATOR_STATUS_FLAGS = 16;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_POS_VERT_ABS: ESTIMATOR_STATUS_FLAGS = 32;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_POS_VERT_AGL: ESTIMATOR_STATUS_FLAGS = 64;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_CONST_POS_MODE: ESTIMATOR_STATUS_FLAGS = 128;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_PRED_POS_HORIZ_REL: ESTIMATOR_STATUS_FLAGS = 256;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_PRED_POS_HORIZ_ABS: ESTIMATOR_STATUS_FLAGS = 512;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_GPS_GLITCH: ESTIMATOR_STATUS_FLAGS = 1024;
pub const ESTIMATOR_STATUS_FLAGS_ESTIMATOR_STATUS_FLAGS_ENUM_END: ESTIMATOR_STATUS_FLAGS = 1025;
pub type ESTIMATOR_STATUS_FLAGS = ::std::os::raw::c_uint;
pub const MOTOR_TEST_ORDER_MOTOR_TEST_ORDER_DEFAULT: MOTOR_TEST_ORDER = 0;
pub const MOTOR_TEST_ORDER_MOTOR_TEST_ORDER_SEQUENCE: MOTOR_TEST_ORDER = 1;
pub const MOTOR_TEST_ORDER_MOTOR_TEST_ORDER_BOARD: MOTOR_TEST_ORDER = 2;
pub const MOTOR_TEST_ORDER_MOTOR_TEST_ORDER_ENUM_END: MOTOR_TEST_ORDER = 3;
pub type MOTOR_TEST_ORDER = ::std::os::raw::c_uint;
pub const MOTOR_TEST_THROTTLE_TYPE_MOTOR_TEST_THROTTLE_PERCENT: MOTOR_TEST_THROTTLE_TYPE = 0;
pub const MOTOR_TEST_THROTTLE_TYPE_MOTOR_TEST_THROTTLE_PWM: MOTOR_TEST_THROTTLE_TYPE = 1;
pub const MOTOR_TEST_THROTTLE_TYPE_MOTOR_TEST_THROTTLE_PILOT: MOTOR_TEST_THROTTLE_TYPE = 2;
pub const MOTOR_TEST_THROTTLE_TYPE_MOTOR_TEST_COMPASS_CAL: MOTOR_TEST_THROTTLE_TYPE = 3;
pub const MOTOR_TEST_THROTTLE_TYPE_MOTOR_TEST_THROTTLE_TYPE_ENUM_END: MOTOR_TEST_THROTTLE_TYPE = 4;
pub type MOTOR_TEST_THROTTLE_TYPE = ::std::os::raw::c_uint;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_ALT: GPS_INPUT_IGNORE_FLAGS = 1;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_HDOP: GPS_INPUT_IGNORE_FLAGS = 2;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_VDOP: GPS_INPUT_IGNORE_FLAGS = 4;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_VEL_HORIZ: GPS_INPUT_IGNORE_FLAGS = 8;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_VEL_VERT: GPS_INPUT_IGNORE_FLAGS = 16;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_SPEED_ACCURACY: GPS_INPUT_IGNORE_FLAGS = 32;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_HORIZONTAL_ACCURACY: GPS_INPUT_IGNORE_FLAGS = 64;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAG_VERTICAL_ACCURACY: GPS_INPUT_IGNORE_FLAGS = 128;
pub const GPS_INPUT_IGNORE_FLAGS_GPS_INPUT_IGNORE_FLAGS_ENUM_END: GPS_INPUT_IGNORE_FLAGS = 129;
pub type GPS_INPUT_IGNORE_FLAGS = ::std::os::raw::c_uint;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_NONE: MAV_COLLISION_ACTION = 0;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_REPORT: MAV_COLLISION_ACTION = 1;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_ASCEND_OR_DESCEND: MAV_COLLISION_ACTION = 2;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_MOVE_HORIZONTALLY: MAV_COLLISION_ACTION = 3;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_MOVE_PERPENDICULAR: MAV_COLLISION_ACTION = 4;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_RTL: MAV_COLLISION_ACTION = 5;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_HOVER: MAV_COLLISION_ACTION = 6;
pub const MAV_COLLISION_ACTION_MAV_COLLISION_ACTION_ENUM_END: MAV_COLLISION_ACTION = 7;
pub type MAV_COLLISION_ACTION = ::std::os::raw::c_uint;
pub const MAV_COLLISION_THREAT_LEVEL_MAV_COLLISION_THREAT_LEVEL_NONE: MAV_COLLISION_THREAT_LEVEL = 0;
pub const MAV_COLLISION_THREAT_LEVEL_MAV_COLLISION_THREAT_LEVEL_LOW: MAV_COLLISION_THREAT_LEVEL = 1;
pub const MAV_COLLISION_THREAT_LEVEL_MAV_COLLISION_THREAT_LEVEL_HIGH: MAV_COLLISION_THREAT_LEVEL = 2;
pub const MAV_COLLISION_THREAT_LEVEL_MAV_COLLISION_THREAT_LEVEL_ENUM_END: MAV_COLLISION_THREAT_LEVEL = 3;
pub type MAV_COLLISION_THREAT_LEVEL = ::std::os::raw::c_uint;
pub const MAV_COLLISION_SRC_MAV_COLLISION_SRC_ADSB: MAV_COLLISION_SRC = 0;
pub const MAV_COLLISION_SRC_MAV_COLLISION_SRC_MAVLINK_GPS_GLOBAL_INT: MAV_COLLISION_SRC = 1;
pub const MAV_COLLISION_SRC_MAV_COLLISION_SRC_ENUM_END: MAV_COLLISION_SRC = 2;
pub type MAV_COLLISION_SRC = ::std::os::raw::c_uint;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_NO_GPS: GPS_FIX_TYPE = 0;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_NO_FIX: GPS_FIX_TYPE = 1;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_2D_FIX: GPS_FIX_TYPE = 2;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_3D_FIX: GPS_FIX_TYPE = 3;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_DGPS: GPS_FIX_TYPE = 4;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_RTK_FLOAT: GPS_FIX_TYPE = 5;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_RTK_FIXED: GPS_FIX_TYPE = 6;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_STATIC: GPS_FIX_TYPE = 7;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_PPP: GPS_FIX_TYPE = 8;
pub const GPS_FIX_TYPE_GPS_FIX_TYPE_ENUM_END: GPS_FIX_TYPE = 9;
pub type GPS_FIX_TYPE = ::std::os::raw::c_uint;
pub const LANDING_TARGET_TYPE_LANDING_TARGET_TYPE_LIGHT_BEACON: LANDING_TARGET_TYPE = 0;
pub const LANDING_TARGET_TYPE_LANDING_TARGET_TYPE_RADIO_BEACON: LANDING_TARGET_TYPE = 1;
pub const LANDING_TARGET_TYPE_LANDING_TARGET_TYPE_VISION_FIDUCIAL: LANDING_TARGET_TYPE = 2;
pub const LANDING_TARGET_TYPE_LANDING_TARGET_TYPE_VISION_OTHER: LANDING_TARGET_TYPE = 3;
pub const LANDING_TARGET_TYPE_LANDING_TARGET_TYPE_ENUM_END: LANDING_TARGET_TYPE = 4;
pub type LANDING_TARGET_TYPE = ::std::os::raw::c_uint;
pub const VTOL_TRANSITION_HEADING_VTOL_TRANSITION_HEADING_VEHICLE_DEFAULT: VTOL_TRANSITION_HEADING = 0;
pub const VTOL_TRANSITION_HEADING_VTOL_TRANSITION_HEADING_NEXT_WAYPOINT: VTOL_TRANSITION_HEADING = 1;
pub const VTOL_TRANSITION_HEADING_VTOL_TRANSITION_HEADING_TAKEOFF: VTOL_TRANSITION_HEADING = 2;
pub const VTOL_TRANSITION_HEADING_VTOL_TRANSITION_HEADING_SPECIFIED: VTOL_TRANSITION_HEADING = 3;
pub const VTOL_TRANSITION_HEADING_VTOL_TRANSITION_HEADING_ANY: VTOL_TRANSITION_HEADING = 4;
pub const VTOL_TRANSITION_HEADING_VTOL_TRANSITION_HEADING_ENUM_END: VTOL_TRANSITION_HEADING = 5;
pub type VTOL_TRANSITION_HEADING = ::std::os::raw::c_uint;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_CAPTURE_VIDEO: CAMERA_CAP_FLAGS = 1;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_CAPTURE_IMAGE: CAMERA_CAP_FLAGS = 2;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_HAS_MODES: CAMERA_CAP_FLAGS = 4;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_CAN_CAPTURE_IMAGE_IN_VIDEO_MODE: CAMERA_CAP_FLAGS = 8;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_CAN_CAPTURE_VIDEO_IN_IMAGE_MODE: CAMERA_CAP_FLAGS = 16;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_HAS_IMAGE_SURVEY_MODE: CAMERA_CAP_FLAGS = 32;
pub const CAMERA_CAP_FLAGS_CAMERA_CAP_FLAGS_ENUM_END: CAMERA_CAP_FLAGS = 33;
pub type CAMERA_CAP_FLAGS = ::std::os::raw::c_uint;
pub const PARAM_ACK_PARAM_ACK_ACCEPTED: PARAM_ACK = 0;
pub const PARAM_ACK_PARAM_ACK_VALUE_UNSUPPORTED: PARAM_ACK = 1;
pub const PARAM_ACK_PARAM_ACK_FAILED: PARAM_ACK = 2;
pub const PARAM_ACK_PARAM_ACK_IN_PROGRESS: PARAM_ACK = 3;
pub const PARAM_ACK_PARAM_ACK_ENUM_END: PARAM_ACK = 4;
pub type PARAM_ACK = ::std::os::raw::c_uint;
pub const CAMERA_MODE_CAMERA_MODE_IMAGE: CAMERA_MODE = 0;
pub const CAMERA_MODE_CAMERA_MODE_VIDEO: CAMERA_MODE = 1;
pub const CAMERA_MODE_CAMERA_MODE_IMAGE_SURVEY: CAMERA_MODE = 2;
pub const CAMERA_MODE_CAMERA_MODE_ENUM_END: CAMERA_MODE = 3;
pub type CAMERA_MODE = ::std::os::raw::c_uint;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_GENERIC: MAV_ARM_AUTH_DENIED_REASON = 0;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_NONE: MAV_ARM_AUTH_DENIED_REASON = 1;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_INVALID_WAYPOINT: MAV_ARM_AUTH_DENIED_REASON = 2;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_TIMEOUT: MAV_ARM_AUTH_DENIED_REASON = 3;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_AIRSPACE_IN_USE: MAV_ARM_AUTH_DENIED_REASON = 4;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_BAD_WEATHER: MAV_ARM_AUTH_DENIED_REASON = 5;
pub const MAV_ARM_AUTH_DENIED_REASON_MAV_ARM_AUTH_DENIED_REASON_ENUM_END: MAV_ARM_AUTH_DENIED_REASON = 6;
pub type MAV_ARM_AUTH_DENIED_REASON = ::std::os::raw::c_uint;
pub const RTK_BASELINE_COORDINATE_SYSTEM_RTK_BASELINE_COORDINATE_SYSTEM_ECEF: RTK_BASELINE_COORDINATE_SYSTEM = 0;
pub const RTK_BASELINE_COORDINATE_SYSTEM_RTK_BASELINE_COORDINATE_SYSTEM_NED: RTK_BASELINE_COORDINATE_SYSTEM = 1;
pub const RTK_BASELINE_COORDINATE_SYSTEM_RTK_BASELINE_COORDINATE_SYSTEM_ENUM_END: RTK_BASELINE_COORDINATE_SYSTEM = 2;
pub type RTK_BASELINE_COORDINATE_SYSTEM = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_heartbeat_t {
    pub custom_mode: u32,
    pub type_: u8,
    pub autopilot: u8,
    pub base_mode: u8,
    pub system_status: u8,
    pub mavlink_version: u8,
}
#[test]
fn bindgen_test_layout___mavlink_heartbeat_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_heartbeat_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_heartbeat_t>(),
        9usize,
        concat!("Size of: ", stringify!(__mavlink_heartbeat_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_heartbeat_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_heartbeat_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).custom_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_heartbeat_t),
            "::",
            stringify!(custom_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_heartbeat_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).autopilot) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_heartbeat_t),
            "::",
            stringify!(autopilot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_mode) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_heartbeat_t),
            "::",
            stringify!(base_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).system_status) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_heartbeat_t),
            "::",
            stringify!(system_status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mavlink_version) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_heartbeat_t),
            "::",
            stringify!(mavlink_version)
        )
    );
}
pub type mavlink_heartbeat_t = __mavlink_heartbeat_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_sys_status_t {
    pub onboard_control_sensors_present: u32,
    pub onboard_control_sensors_enabled: u32,
    pub onboard_control_sensors_health: u32,
    pub load: u16,
    pub voltage_battery: u16,
    pub current_battery: i16,
    pub drop_rate_comm: u16,
    pub errors_comm: u16,
    pub errors_count1: u16,
    pub errors_count2: u16,
    pub errors_count3: u16,
    pub errors_count4: u16,
    pub battery_remaining: i8,
}
#[test]
fn bindgen_test_layout___mavlink_sys_status_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_sys_status_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_sys_status_t>(),
        31usize,
        concat!("Size of: ", stringify!(__mavlink_sys_status_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_sys_status_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_sys_status_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onboard_control_sensors_present) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(onboard_control_sensors_present)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onboard_control_sensors_enabled) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(onboard_control_sensors_enabled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).onboard_control_sensors_health) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(onboard_control_sensors_health)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).load) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(load)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voltage_battery) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(voltage_battery)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current_battery) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(current_battery)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drop_rate_comm) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(drop_rate_comm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errors_comm) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(errors_comm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errors_count1) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(errors_count1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errors_count2) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(errors_count2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errors_count3) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(errors_count3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).errors_count4) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(errors_count4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).battery_remaining) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_sys_status_t),
            "::",
            stringify!(battery_remaining)
        )
    );
}
pub type mavlink_sys_status_t = __mavlink_sys_status_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_system_time_t {
    pub time_unix_usec: u64,
    pub time_boot_ms: u32,
}
#[test]
fn bindgen_test_layout___mavlink_system_time_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_system_time_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_system_time_t>(),
        12usize,
        concat!("Size of: ", stringify!(__mavlink_system_time_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_system_time_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_system_time_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_unix_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_system_time_t),
            "::",
            stringify!(time_unix_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_system_time_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
}
pub type mavlink_system_time_t = __mavlink_system_time_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_ping_t {
    pub time_usec: u64,
    pub seq: u32,
    pub target_system: u8,
    pub target_component: u8,
}
#[test]
fn bindgen_test_layout___mavlink_ping_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_ping_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_ping_t>(),
        14usize,
        concat!("Size of: ", stringify!(__mavlink_ping_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_ping_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_ping_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_ping_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(__mavlink_ping_t), "::", stringify!(seq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_ping_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_ping_t),
            "::",
            stringify!(target_component)
        )
    );
}
pub type mavlink_ping_t = __mavlink_ping_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_change_operator_control_t {
    pub target_system: u8,
    pub control_request: u8,
    pub version: u8,
    pub passkey: [::std::os::raw::c_char; 25usize],
}
#[test]
fn bindgen_test_layout___mavlink_change_operator_control_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_change_operator_control_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_change_operator_control_t>(),
        28usize,
        concat!("Size of: ", stringify!(__mavlink_change_operator_control_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_change_operator_control_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_change_operator_control_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).control_request) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_t),
            "::",
            stringify!(control_request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_t),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).passkey) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_t),
            "::",
            stringify!(passkey)
        )
    );
}
pub type mavlink_change_operator_control_t = __mavlink_change_operator_control_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_change_operator_control_ack_t {
    pub gcs_system_id: u8,
    pub control_request: u8,
    pub ack: u8,
}
#[test]
fn bindgen_test_layout___mavlink_change_operator_control_ack_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_change_operator_control_ack_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_change_operator_control_ack_t>(),
        3usize,
        concat!("Size of: ", stringify!(__mavlink_change_operator_control_ack_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_change_operator_control_ack_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_change_operator_control_ack_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gcs_system_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_ack_t),
            "::",
            stringify!(gcs_system_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).control_request) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_ack_t),
            "::",
            stringify!(control_request)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ack) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_change_operator_control_ack_t),
            "::",
            stringify!(ack)
        )
    );
}
pub type mavlink_change_operator_control_ack_t = __mavlink_change_operator_control_ack_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_auth_key_t {
    pub key: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout___mavlink_auth_key_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_auth_key_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_auth_key_t>(),
        32usize,
        concat!("Size of: ", stringify!(__mavlink_auth_key_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_auth_key_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_auth_key_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_auth_key_t),
            "::",
            stringify!(key)
        )
    );
}
pub type mavlink_auth_key_t = __mavlink_auth_key_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_set_mode_t {
    pub custom_mode: u32,
    pub target_system: u8,
    pub base_mode: u8,
}
#[test]
fn bindgen_test_layout___mavlink_set_mode_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_set_mode_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_set_mode_t>(),
        6usize,
        concat!("Size of: ", stringify!(__mavlink_set_mode_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_set_mode_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_set_mode_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).custom_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_mode_t),
            "::",
            stringify!(custom_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_mode_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_mode) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_mode_t),
            "::",
            stringify!(base_mode)
        )
    );
}
pub type mavlink_set_mode_t = __mavlink_set_mode_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_param_request_read_t {
    pub param_index: i16,
    pub target_system: u8,
    pub target_component: u8,
    pub param_id: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout___mavlink_param_request_read_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_param_request_read_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_param_request_read_t>(),
        20usize,
        concat!("Size of: ", stringify!(__mavlink_param_request_read_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_param_request_read_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_param_request_read_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_request_read_t),
            "::",
            stringify!(param_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_request_read_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_request_read_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_request_read_t),
            "::",
            stringify!(param_id)
        )
    );
}
pub type mavlink_param_request_read_t = __mavlink_param_request_read_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_param_request_list_t {
    pub target_system: u8,
    pub target_component: u8,
}
#[test]
fn bindgen_test_layout___mavlink_param_request_list_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_param_request_list_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_param_request_list_t>(),
        2usize,
        concat!("Size of: ", stringify!(__mavlink_param_request_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_param_request_list_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_param_request_list_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_request_list_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_request_list_t),
            "::",
            stringify!(target_component)
        )
    );
}
pub type mavlink_param_request_list_t = __mavlink_param_request_list_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_param_value_t {
    pub param_value: f32,
    pub param_count: u16,
    pub param_index: u16,
    pub param_id: [::std::os::raw::c_char; 16usize],
    pub param_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_param_value_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_param_value_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_param_value_t>(),
        25usize,
        concat!("Size of: ", stringify!(__mavlink_param_value_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_param_value_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_param_value_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_value_t),
            "::",
            stringify!(param_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_value_t),
            "::",
            stringify!(param_count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_index) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_value_t),
            "::",
            stringify!(param_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_value_t),
            "::",
            stringify!(param_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_value_t),
            "::",
            stringify!(param_type)
        )
    );
}
pub type mavlink_param_value_t = __mavlink_param_value_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_param_set_t {
    pub param_value: f32,
    pub target_system: u8,
    pub target_component: u8,
    pub param_id: [::std::os::raw::c_char; 16usize],
    pub param_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_param_set_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_param_set_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_param_set_t>(),
        23usize,
        concat!("Size of: ", stringify!(__mavlink_param_set_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_param_set_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_param_set_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_set_t),
            "::",
            stringify!(param_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_set_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_set_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_id) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_set_t),
            "::",
            stringify!(param_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_type) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_set_t),
            "::",
            stringify!(param_type)
        )
    );
}
pub type mavlink_param_set_t = __mavlink_param_set_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_gps_raw_int_t {
    pub time_usec: u64,
    pub lat: i32,
    pub lon: i32,
    pub alt: i32,
    pub eph: u16,
    pub epv: u16,
    pub vel: u16,
    pub cog: u16,
    pub fix_type: u8,
    pub satellites_visible: u8,
    pub alt_ellipsoid: i32,
    pub h_acc: u32,
    pub v_acc: u32,
    pub vel_acc: u32,
    pub hdg_acc: u32,
}
#[test]
fn bindgen_test_layout___mavlink_gps_raw_int_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_gps_raw_int_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_gps_raw_int_t>(),
        50usize,
        concat!("Size of: ", stringify!(__mavlink_gps_raw_int_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_gps_raw_int_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_gps_raw_int_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lat) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lon) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eph) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(eph)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).epv) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(epv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vel) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(vel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cog) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(cog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fix_type) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(fix_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellites_visible) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(satellites_visible)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt_ellipsoid) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(alt_ellipsoid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h_acc) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(h_acc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_acc) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(v_acc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vel_acc) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(vel_acc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hdg_acc) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_raw_int_t),
            "::",
            stringify!(hdg_acc)
        )
    );
}
pub type mavlink_gps_raw_int_t = __mavlink_gps_raw_int_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_gps_status_t {
    pub satellites_visible: u8,
    pub satellite_prn: [u8; 20usize],
    pub satellite_used: [u8; 20usize],
    pub satellite_elevation: [u8; 20usize],
    pub satellite_azimuth: [u8; 20usize],
    pub satellite_snr: [u8; 20usize],
}
#[test]
fn bindgen_test_layout___mavlink_gps_status_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_gps_status_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_gps_status_t>(),
        101usize,
        concat!("Size of: ", stringify!(__mavlink_gps_status_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_gps_status_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_gps_status_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellites_visible) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_status_t),
            "::",
            stringify!(satellites_visible)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellite_prn) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_status_t),
            "::",
            stringify!(satellite_prn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellite_used) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_status_t),
            "::",
            stringify!(satellite_used)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellite_elevation) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_status_t),
            "::",
            stringify!(satellite_elevation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellite_azimuth) as usize - ptr as usize },
        61usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_status_t),
            "::",
            stringify!(satellite_azimuth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).satellite_snr) as usize - ptr as usize },
        81usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_status_t),
            "::",
            stringify!(satellite_snr)
        )
    );
}
pub type mavlink_gps_status_t = __mavlink_gps_status_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_scaled_imu_t {
    pub time_boot_ms: u32,
    pub xacc: i16,
    pub yacc: i16,
    pub zacc: i16,
    pub xgyro: i16,
    pub ygyro: i16,
    pub zgyro: i16,
    pub xmag: i16,
    pub ymag: i16,
    pub zmag: i16,
}
#[test]
fn bindgen_test_layout___mavlink_scaled_imu_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_scaled_imu_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_scaled_imu_t>(),
        22usize,
        concat!("Size of: ", stringify!(__mavlink_scaled_imu_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_scaled_imu_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_scaled_imu_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xacc) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(xacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yacc) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(yacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zacc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(zacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xgyro) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(xgyro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ygyro) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(ygyro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zgyro) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(zgyro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(xmag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ymag) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(ymag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zmag) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_imu_t),
            "::",
            stringify!(zmag)
        )
    );
}
pub type mavlink_scaled_imu_t = __mavlink_scaled_imu_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_raw_imu_t {
    pub time_usec: u64,
    pub xacc: i16,
    pub yacc: i16,
    pub zacc: i16,
    pub xgyro: i16,
    pub ygyro: i16,
    pub zgyro: i16,
    pub xmag: i16,
    pub ymag: i16,
    pub zmag: i16,
}
#[test]
fn bindgen_test_layout___mavlink_raw_imu_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_raw_imu_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_raw_imu_t>(),
        26usize,
        concat!("Size of: ", stringify!(__mavlink_raw_imu_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_raw_imu_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_raw_imu_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xacc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(xacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yacc) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(yacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zacc) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(zacc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xgyro) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(xgyro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ygyro) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(ygyro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zgyro) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(zgyro)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmag) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(xmag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ymag) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(ymag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zmag) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_imu_t),
            "::",
            stringify!(zmag)
        )
    );
}
pub type mavlink_raw_imu_t = __mavlink_raw_imu_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_raw_pressure_t {
    pub time_usec: u64,
    pub press_abs: i16,
    pub press_diff1: i16,
    pub press_diff2: i16,
    pub temperature: i16,
}
#[test]
fn bindgen_test_layout___mavlink_raw_pressure_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_raw_pressure_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_raw_pressure_t>(),
        16usize,
        concat!("Size of: ", stringify!(__mavlink_raw_pressure_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_raw_pressure_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_raw_pressure_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_pressure_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).press_abs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_pressure_t),
            "::",
            stringify!(press_abs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).press_diff1) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_pressure_t),
            "::",
            stringify!(press_diff1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).press_diff2) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_pressure_t),
            "::",
            stringify!(press_diff2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temperature) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_raw_pressure_t),
            "::",
            stringify!(temperature)
        )
    );
}
pub type mavlink_raw_pressure_t = __mavlink_raw_pressure_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_scaled_pressure_t {
    pub time_boot_ms: u32,
    pub press_abs: f32,
    pub press_diff: f32,
    pub temperature: i16,
}
#[test]
fn bindgen_test_layout___mavlink_scaled_pressure_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_scaled_pressure_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_scaled_pressure_t>(),
        14usize,
        concat!("Size of: ", stringify!(__mavlink_scaled_pressure_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_scaled_pressure_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_scaled_pressure_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_pressure_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).press_abs) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_pressure_t),
            "::",
            stringify!(press_abs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).press_diff) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_pressure_t),
            "::",
            stringify!(press_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).temperature) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_scaled_pressure_t),
            "::",
            stringify!(temperature)
        )
    );
}
pub type mavlink_scaled_pressure_t = __mavlink_scaled_pressure_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_attitude_t {
    pub time_boot_ms: u32,
    pub roll: f32,
    pub pitch: f32,
    pub yaw: f32,
    pub rollspeed: f32,
    pub pitchspeed: f32,
    pub yawspeed: f32,
}
#[test]
fn bindgen_test_layout___mavlink_attitude_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_attitude_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_attitude_t>(),
        28usize,
        concat!("Size of: ", stringify!(__mavlink_attitude_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_attitude_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_attitude_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).roll) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(roll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pitch) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(pitch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yaw) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(yaw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rollspeed) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(rollspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pitchspeed) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(pitchspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yawspeed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_t),
            "::",
            stringify!(yawspeed)
        )
    );
}
pub type mavlink_attitude_t = __mavlink_attitude_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_attitude_quaternion_t {
    pub time_boot_ms: u32,
    pub q1: f32,
    pub q2: f32,
    pub q3: f32,
    pub q4: f32,
    pub rollspeed: f32,
    pub pitchspeed: f32,
    pub yawspeed: f32,
}
#[test]
fn bindgen_test_layout___mavlink_attitude_quaternion_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_attitude_quaternion_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_attitude_quaternion_t>(),
        32usize,
        concat!("Size of: ", stringify!(__mavlink_attitude_quaternion_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_attitude_quaternion_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_attitude_quaternion_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q1) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(q1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(q2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q3) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(q3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q4) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(q4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rollspeed) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(rollspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pitchspeed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(pitchspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yawspeed) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_t),
            "::",
            stringify!(yawspeed)
        )
    );
}
pub type mavlink_attitude_quaternion_t = __mavlink_attitude_quaternion_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_local_position_ned_t {
    pub time_boot_ms: u32,
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub vx: f32,
    pub vy: f32,
    pub vz: f32,
}
#[test]
fn bindgen_test_layout___mavlink_local_position_ned_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_local_position_ned_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_local_position_ned_t>(),
        28usize,
        concat!("Size of: ", stringify!(__mavlink_local_position_ned_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_local_position_ned_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_local_position_ned_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(vx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vy) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(vy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vz) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_local_position_ned_t),
            "::",
            stringify!(vz)
        )
    );
}
pub type mavlink_local_position_ned_t = __mavlink_local_position_ned_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_global_position_int_t {
    pub time_boot_ms: u32,
    pub lat: i32,
    pub lon: i32,
    pub alt: i32,
    pub relative_alt: i32,
    pub vx: i16,
    pub vy: i16,
    pub vz: i16,
    pub hdg: u16,
}
#[test]
fn bindgen_test_layout___mavlink_global_position_int_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_global_position_int_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_global_position_int_t>(),
        28usize,
        concat!("Size of: ", stringify!(__mavlink_global_position_int_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_global_position_int_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_global_position_int_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lat) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lon) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative_alt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(relative_alt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vx) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(vx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vy) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(vy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vz) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(vz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hdg) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_t),
            "::",
            stringify!(hdg)
        )
    );
}
pub type mavlink_global_position_int_t = __mavlink_global_position_int_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_rc_channels_scaled_t {
    pub time_boot_ms: u32,
    pub chan1_scaled: i16,
    pub chan2_scaled: i16,
    pub chan3_scaled: i16,
    pub chan4_scaled: i16,
    pub chan5_scaled: i16,
    pub chan6_scaled: i16,
    pub chan7_scaled: i16,
    pub chan8_scaled: i16,
    pub port: u8,
    pub rssi: u8,
}
#[test]
fn bindgen_test_layout___mavlink_rc_channels_scaled_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_rc_channels_scaled_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_rc_channels_scaled_t>(),
        22usize,
        concat!("Size of: ", stringify!(__mavlink_rc_channels_scaled_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_rc_channels_scaled_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_rc_channels_scaled_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan1_scaled) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan1_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan2_scaled) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan2_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan3_scaled) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan3_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan4_scaled) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan4_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan5_scaled) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan5_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan6_scaled) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan6_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan7_scaled) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan7_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan8_scaled) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(chan8_scaled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rssi) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_scaled_t),
            "::",
            stringify!(rssi)
        )
    );
}
pub type mavlink_rc_channels_scaled_t = __mavlink_rc_channels_scaled_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_rc_channels_raw_t {
    pub time_boot_ms: u32,
    pub chan1_raw: u16,
    pub chan2_raw: u16,
    pub chan3_raw: u16,
    pub chan4_raw: u16,
    pub chan5_raw: u16,
    pub chan6_raw: u16,
    pub chan7_raw: u16,
    pub chan8_raw: u16,
    pub port: u8,
    pub rssi: u8,
}
#[test]
fn bindgen_test_layout___mavlink_rc_channels_raw_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_rc_channels_raw_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_rc_channels_raw_t>(),
        22usize,
        concat!("Size of: ", stringify!(__mavlink_rc_channels_raw_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_rc_channels_raw_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_rc_channels_raw_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_boot_ms) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(time_boot_ms)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan1_raw) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan1_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan2_raw) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan2_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan3_raw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan3_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan4_raw) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan4_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan5_raw) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan5_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan6_raw) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan6_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan7_raw) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan7_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chan8_raw) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(chan8_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rssi) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_rc_channels_raw_t),
            "::",
            stringify!(rssi)
        )
    );
}
pub type mavlink_rc_channels_raw_t = __mavlink_rc_channels_raw_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_servo_output_raw_t {
    pub time_usec: u32,
    pub servo1_raw: u16,
    pub servo2_raw: u16,
    pub servo3_raw: u16,
    pub servo4_raw: u16,
    pub servo5_raw: u16,
    pub servo6_raw: u16,
    pub servo7_raw: u16,
    pub servo8_raw: u16,
    pub port: u8,
    pub servo9_raw: u16,
    pub servo10_raw: u16,
    pub servo11_raw: u16,
    pub servo12_raw: u16,
    pub servo13_raw: u16,
    pub servo14_raw: u16,
    pub servo15_raw: u16,
    pub servo16_raw: u16,
}
#[test]
fn bindgen_test_layout___mavlink_servo_output_raw_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_servo_output_raw_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_servo_output_raw_t>(),
        37usize,
        concat!("Size of: ", stringify!(__mavlink_servo_output_raw_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_servo_output_raw_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_servo_output_raw_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo1_raw) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo1_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo2_raw) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo2_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo3_raw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo3_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo4_raw) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo4_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo5_raw) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo5_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo6_raw) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo6_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo7_raw) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo7_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo8_raw) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo8_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo9_raw) as usize - ptr as usize },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo9_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo10_raw) as usize - ptr as usize },
        23usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo10_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo11_raw) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo11_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo12_raw) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo12_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo13_raw) as usize - ptr as usize },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo13_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo14_raw) as usize - ptr as usize },
        31usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo14_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo15_raw) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo15_raw)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).servo16_raw) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_servo_output_raw_t),
            "::",
            stringify!(servo16_raw)
        )
    );
}
pub type mavlink_servo_output_raw_t = __mavlink_servo_output_raw_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_request_partial_list_t {
    pub start_index: i16,
    pub end_index: i16,
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_request_partial_list_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_request_partial_list_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_request_partial_list_t>(),
        7usize,
        concat!("Size of: ", stringify!(__mavlink_mission_request_partial_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_request_partial_list_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_request_partial_list_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_partial_list_t),
            "::",
            stringify!(start_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_index) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_partial_list_t),
            "::",
            stringify!(end_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_partial_list_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_partial_list_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_partial_list_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_request_partial_list_t = __mavlink_mission_request_partial_list_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_write_partial_list_t {
    pub start_index: i16,
    pub end_index: i16,
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_write_partial_list_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_write_partial_list_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_write_partial_list_t>(),
        7usize,
        concat!("Size of: ", stringify!(__mavlink_mission_write_partial_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_write_partial_list_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_write_partial_list_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_write_partial_list_t),
            "::",
            stringify!(start_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_index) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_write_partial_list_t),
            "::",
            stringify!(end_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_write_partial_list_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_write_partial_list_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_write_partial_list_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_write_partial_list_t = __mavlink_mission_write_partial_list_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_item_t {
    pub param1: f32,
    pub param2: f32,
    pub param3: f32,
    pub param4: f32,
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub seq: u16,
    pub command: u16,
    pub target_system: u8,
    pub target_component: u8,
    pub frame: u8,
    pub current: u8,
    pub autocontinue: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_item_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_item_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_item_t>(),
        38usize,
        concat!("Size of: ", stringify!(__mavlink_mission_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_item_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_item_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(param1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(param2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param3) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(param3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param4) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(param4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).command) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(command)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).current) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(current)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).autocontinue) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(autocontinue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_item_t = __mavlink_mission_item_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_request_t {
    pub seq: u16,
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_request_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_request_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_request_t>(),
        5usize,
        concat!("Size of: ", stringify!(__mavlink_mission_request_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_request_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_request_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_request_t = __mavlink_mission_request_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_set_current_t {
    pub seq: u16,
    pub target_system: u8,
    pub target_component: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_set_current_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_set_current_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_set_current_t>(),
        4usize,
        concat!("Size of: ", stringify!(__mavlink_mission_set_current_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_set_current_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_set_current_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_set_current_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_set_current_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_set_current_t),
            "::",
            stringify!(target_component)
        )
    );
}
pub type mavlink_mission_set_current_t = __mavlink_mission_set_current_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_current_t {
    pub seq: u16,
}
#[test]
fn bindgen_test_layout___mavlink_mission_current_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_current_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_current_t>(),
        2usize,
        concat!("Size of: ", stringify!(__mavlink_mission_current_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_current_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_current_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_current_t),
            "::",
            stringify!(seq)
        )
    );
}
pub type mavlink_mission_current_t = __mavlink_mission_current_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_request_list_t {
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_request_list_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_request_list_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_request_list_t>(),
        3usize,
        concat!("Size of: ", stringify!(__mavlink_mission_request_list_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_request_list_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_request_list_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_list_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_list_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_list_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_request_list_t = __mavlink_mission_request_list_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_count_t {
    pub count: u16,
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_count_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_count_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_count_t>(),
        5usize,
        concat!("Size of: ", stringify!(__mavlink_mission_count_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_count_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_count_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_count_t),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_count_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_count_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_count_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_count_t = __mavlink_mission_count_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_clear_all_t {
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_clear_all_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_clear_all_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_clear_all_t>(),
        3usize,
        concat!("Size of: ", stringify!(__mavlink_mission_clear_all_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_clear_all_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_clear_all_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_clear_all_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_clear_all_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_clear_all_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_clear_all_t = __mavlink_mission_clear_all_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_item_reached_t {
    pub seq: u16,
}
#[test]
fn bindgen_test_layout___mavlink_mission_item_reached_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_item_reached_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_item_reached_t>(),
        2usize,
        concat!("Size of: ", stringify!(__mavlink_mission_item_reached_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_item_reached_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_item_reached_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_item_reached_t),
            "::",
            stringify!(seq)
        )
    );
}
pub type mavlink_mission_item_reached_t = __mavlink_mission_item_reached_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_ack_t {
    pub target_system: u8,
    pub target_component: u8,
    pub type_: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_ack_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_ack_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_ack_t>(),
        4usize,
        concat!("Size of: ", stringify!(__mavlink_mission_ack_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_ack_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_ack_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_ack_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_ack_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_ack_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_ack_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_ack_t = __mavlink_mission_ack_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_set_gps_global_origin_t {
    pub latitude: i32,
    pub longitude: i32,
    pub altitude: i32,
    pub target_system: u8,
    pub time_usec: u64,
}
#[test]
fn bindgen_test_layout___mavlink_set_gps_global_origin_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_set_gps_global_origin_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_set_gps_global_origin_t>(),
        21usize,
        concat!("Size of: ", stringify!(__mavlink_set_gps_global_origin_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_set_gps_global_origin_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_set_gps_global_origin_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).latitude) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_gps_global_origin_t),
            "::",
            stringify!(latitude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).longitude) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_gps_global_origin_t),
            "::",
            stringify!(longitude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).altitude) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_gps_global_origin_t),
            "::",
            stringify!(altitude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_gps_global_origin_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_set_gps_global_origin_t),
            "::",
            stringify!(time_usec)
        )
    );
}
pub type mavlink_set_gps_global_origin_t = __mavlink_set_gps_global_origin_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_gps_global_origin_t {
    pub latitude: i32,
    pub longitude: i32,
    pub altitude: i32,
    pub time_usec: u64,
}
#[test]
fn bindgen_test_layout___mavlink_gps_global_origin_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_gps_global_origin_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_gps_global_origin_t>(),
        20usize,
        concat!("Size of: ", stringify!(__mavlink_gps_global_origin_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_gps_global_origin_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_gps_global_origin_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).latitude) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_global_origin_t),
            "::",
            stringify!(latitude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).longitude) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_global_origin_t),
            "::",
            stringify!(longitude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).altitude) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_global_origin_t),
            "::",
            stringify!(altitude)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_gps_global_origin_t),
            "::",
            stringify!(time_usec)
        )
    );
}
pub type mavlink_gps_global_origin_t = __mavlink_gps_global_origin_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_param_map_rc_t {
    pub param_value0: f32,
    pub scale: f32,
    pub param_value_min: f32,
    pub param_value_max: f32,
    pub param_index: i16,
    pub target_system: u8,
    pub target_component: u8,
    pub param_id: [::std::os::raw::c_char; 16usize],
    pub parameter_rc_channel_index: u8,
}
#[test]
fn bindgen_test_layout___mavlink_param_map_rc_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_param_map_rc_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_param_map_rc_t>(),
        37usize,
        concat!("Size of: ", stringify!(__mavlink_param_map_rc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_param_map_rc_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_param_map_rc_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_value0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(param_value0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_value_min) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(param_value_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_value_max) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(param_value_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_index) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(param_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_id) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(param_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parameter_rc_channel_index) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_param_map_rc_t),
            "::",
            stringify!(parameter_rc_channel_index)
        )
    );
}
pub type mavlink_param_map_rc_t = __mavlink_param_map_rc_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_mission_request_int_t {
    pub seq: u16,
    pub target_system: u8,
    pub target_component: u8,
    pub mission_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_mission_request_int_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_mission_request_int_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_mission_request_int_t>(),
        5usize,
        concat!("Size of: ", stringify!(__mavlink_mission_request_int_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_mission_request_int_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_mission_request_int_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_int_t),
            "::",
            stringify!(seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_int_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_int_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mission_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_mission_request_int_t),
            "::",
            stringify!(mission_type)
        )
    );
}
pub type mavlink_mission_request_int_t = __mavlink_mission_request_int_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_safety_set_allowed_area_t {
    pub p1x: f32,
    pub p1y: f32,
    pub p1z: f32,
    pub p2x: f32,
    pub p2y: f32,
    pub p2z: f32,
    pub target_system: u8,
    pub target_component: u8,
    pub frame: u8,
}
#[test]
fn bindgen_test_layout___mavlink_safety_set_allowed_area_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_safety_set_allowed_area_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_safety_set_allowed_area_t>(),
        27usize,
        concat!("Size of: ", stringify!(__mavlink_safety_set_allowed_area_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_safety_set_allowed_area_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_safety_set_allowed_area_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p1x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(p1x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p1y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(p1y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p1z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(p1z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p2x) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(p2x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p2y) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(p2y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p2z) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(p2z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_system) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(target_system)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_component) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(target_component)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_set_allowed_area_t),
            "::",
            stringify!(frame)
        )
    );
}
pub type mavlink_safety_set_allowed_area_t = __mavlink_safety_set_allowed_area_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_safety_allowed_area_t {
    pub p1x: f32,
    pub p1y: f32,
    pub p1z: f32,
    pub p2x: f32,
    pub p2y: f32,
    pub p2z: f32,
    pub frame: u8,
}
#[test]
fn bindgen_test_layout___mavlink_safety_allowed_area_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_safety_allowed_area_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_safety_allowed_area_t>(),
        25usize,
        concat!("Size of: ", stringify!(__mavlink_safety_allowed_area_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_safety_allowed_area_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_safety_allowed_area_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p1x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(p1x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p1y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(p1y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p1z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(p1z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p2x) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(p2x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p2y) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(p2y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).p2z) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(p2z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frame) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_safety_allowed_area_t),
            "::",
            stringify!(frame)
        )
    );
}
pub type mavlink_safety_allowed_area_t = __mavlink_safety_allowed_area_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_attitude_quaternion_cov_t {
    pub time_usec: u64,
    pub q: [f32; 4usize],
    pub rollspeed: f32,
    pub pitchspeed: f32,
    pub yawspeed: f32,
    pub covariance: [f32; 9usize],
}
#[test]
fn bindgen_test_layout___mavlink_attitude_quaternion_cov_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_attitude_quaternion_cov_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_attitude_quaternion_cov_t>(),
        72usize,
        concat!("Size of: ", stringify!(__mavlink_attitude_quaternion_cov_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_attitude_quaternion_cov_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_attitude_quaternion_cov_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_cov_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).q) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_cov_t),
            "::",
            stringify!(q)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rollspeed) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_cov_t),
            "::",
            stringify!(rollspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pitchspeed) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_cov_t),
            "::",
            stringify!(pitchspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yawspeed) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_cov_t),
            "::",
            stringify!(yawspeed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).covariance) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_attitude_quaternion_cov_t),
            "::",
            stringify!(covariance)
        )
    );
}
pub type mavlink_attitude_quaternion_cov_t = __mavlink_attitude_quaternion_cov_t;
#[repr(C, packed)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __mavlink_nav_controller_output_t {
    pub nav_roll: f32,
    pub nav_pitch: f32,
    pub alt_error: f32,
    pub aspd_error: f32,
    pub xtrack_error: f32,
    pub nav_bearing: i16,
    pub target_bearing: i16,
    pub wp_dist: u16,
}
#[test]
fn bindgen_test_layout___mavlink_nav_controller_output_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_nav_controller_output_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_nav_controller_output_t>(),
        26usize,
        concat!("Size of: ", stringify!(__mavlink_nav_controller_output_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_nav_controller_output_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_nav_controller_output_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nav_roll) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(nav_roll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nav_pitch) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(nav_pitch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt_error) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(alt_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aspd_error) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(aspd_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xtrack_error) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(xtrack_error)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nav_bearing) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(nav_bearing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target_bearing) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(target_bearing)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wp_dist) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_nav_controller_output_t),
            "::",
            stringify!(wp_dist)
        )
    );
}
pub type mavlink_nav_controller_output_t = __mavlink_nav_controller_output_t;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct __mavlink_global_position_int_cov_t {
    pub time_usec: u64,
    pub lat: i32,
    pub lon: i32,
    pub alt: i32,
    pub relative_alt: i32,
    pub vx: f32,
    pub vy: f32,
    pub vz: f32,
    pub covariance: [f32; 36usize],
    pub estimator_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_global_position_int_cov_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_global_position_int_cov_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_global_position_int_cov_t>(),
        181usize,
        concat!("Size of: ", stringify!(__mavlink_global_position_int_cov_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_global_position_int_cov_t>(),
        1usize,
        concat!("Alignment of ", stringify!(__mavlink_global_position_int_cov_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time_usec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(time_usec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lat) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(lat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lon) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(lon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(alt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative_alt) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(relative_alt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vx) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(vx)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vy) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(vy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vz) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(vz)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).covariance) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(covariance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).estimator_type) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(__mavlink_global_position_int_cov_t),
            "::",
            stringify!(estimator_type)
        )
    );
}
impl Default for __mavlink_global_position_int_cov_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type mavlink_global_position_int_cov_t = __mavlink_global_position_int_cov_t;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct __mavlink_local_position_ned_cov_t {
    pub time_usec: u64,
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub vx: f32,
    pub vy: f32,
    pub vz: f32,
    pub ax: f32,
    pub ay: f32,
    pub az: f32,
    pub covariance: [f32; 45usize],
    pub estimator_type: u8,
}
#[test]
fn bindgen_test_layout___mavlink_local_position_ned_cov_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mavlink_local_position_ned_cov_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mavlink_local_position_ned_cov_t>(),
        225usize,
        concat!("Size of: ", stringify!(__mavlink_local_position_ned_cov_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mavlink_local_position_ned_cov_t>(),
        1usize,
